betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f407xx.h
/******************  Bit definition for DAC_DH8R2 register  ******************/
#define DAC_DH8R2_DATA_Pos                                          (0U)
#define DAC_DH8R2_DATA_Msk                                          (0xFFUL << DAC_DH8R2_DATA_Pos)                                 /*!< 0x000000FF */
#define DAC_DH8R2_DATA                                              DAC_DH8R2_DATA_Msk                                             /*!<DAC channel2 8-bit Right aligned data */

/*****************  Bit definition for DAC_DH12RDUAL register  ******************/
#define DAC_DH12RDUAL_DATACH1_Pos                                   (0U)
#define DAC_DH12RDUAL_DATACH1_Msk                                   (0xFFFUL << DAC_DH12RDUAL_DATACH1_Pos)                         /*!< 0x00000FFF */
#define DAC_DH12RDUAL_DATACH1                                       DAC_DH12RDUAL_DATACH1_Msk                                      /*!<DAC channel1 12-bit Right aligned data */
#define DAC_DH12RDUAL_DATACH2_Pos                                   (16U)
#define DAC_DH12RDUAL_DATACH2_Msk                                   (0xFFFUL << DAC_DH12RDUAL_DATACH2_Pos)                         /*!< 0x0FFF0000 */
#define DAC_DH12RDUAL_DATACH2                                       DAC_DH12RDUAL_DATACH2_Msk                                      /*!<DAC channel2 12-bit Right aligned data */

/*****************  Bit definition for DAC_DH12LDUAL register  ******************/
#define DAC_DH12LDUAL_DATACH1_Pos                                   (4U)
#define DAC_DH12LDUAL_DATACH1_Msk                                   (0xFFFUL << DAC_DH12LDUAL_DATACH1_Pos)                         /*!< 0x0000FFF0 */
#define DAC_DH12LDUAL_DATACH1                                       DAC_DH12LDUAL_DATACH1_Msk                                      /*!<DAC channel1 12-bit Left aligned data */
#define DAC_DH12LDUAL_DATACH2_Pos                                   (20U)
#define DAC_DH12LDUAL_DATACH2_Msk                                   (0xFFFUL << DAC_DH12LDUAL_DATACH2_Pos)                         /*!< 0xFFF00000 */
#define DAC_DH12LDUAL_DATACH2                                       DAC_DH12LDUAL_DATACH2_Msk                                      /*!<DAC channel2 12-bit Left aligned data */

/******************  Bit definition for DAC_DH8RDUAL register  ******************/
#define DAC_DH8RDUAL_DATACH1_Pos                                    (0U)
#define DAC_DH8RDUAL_DATACH1_Msk                                    (0xFFUL << DAC_DH8RDUAL_DATACH1_Pos)                           /*!< 0x000000FF */
#define DAC_DH8RDUAL_DATACH1                                        DAC_DH8RDUAL_DATACH1_Msk                                       /*!<DAC channel1 8-bit Right aligned data */
#define DAC_DH8RDUAL_DATACH2_Pos                                    (8U)
#define DAC_DH8RDUAL_DATACH2_Msk                                    (0xFFUL << DAC_DH8RDUAL_DATACH2_Pos)                           /*!< 0x0000FF00 */
#define DAC_DH8RDUAL_DATACH2                                        DAC_DH8RDUAL_DATACH2_Msk                                       /*!<DAC channel2 8-bit Right aligned data */

/*******************  Bit definition for DAC_DATAOCH1 register  *******************/
#define DAC_DATAOCH1_DATA_Pos                                       (0U)
#define DAC_DATAOCH1_DATA_Msk                                       (0xFFFUL << DAC_DATAOCH1_DATA_Pos)                             /*!< 0x00000FFF */
#define DAC_DATAOCH1_DATA                                           DAC_DATAOCH1_DATA_Msk                                          /*!<DAC channel1 data output */

/*******************  Bit definition for DAC_DATAOCH2 register  *******************/
#define DAC_DATAOCH2_DATA_Pos                                       (0U)
#define DAC_DATAOCH2_DATA_Msk                                       (0xFFFUL << DAC_DATAOCH2_DATA_Pos)                             /*!< 0x00000FFF */
#define DAC_DATAOCH2_DATA                                           DAC_DATAOCH2_DATA_Msk                                          /*!<DAC channel2 data output */

/********************  Bit definition for DAC_STS register  ********************/
#define DAC_STS_DMAUDFLG1_Pos                                       (13U)
#define DAC_STS_DMAUDFLG1_Msk                                       (0x1UL << DAC_STS_DMAUDFLG1_Pos)                               /*!< 0x00002000 */
#define DAC_STS_DMAUDFLG1                                           DAC_STS_DMAUDFLG1_Msk                                          /*!<DAC channel1 DMA underrun flag */
#define DAC_STS_DMAUDFLG2_Pos                                       (29U)
#define DAC_STS_DMAUDFLG2_Msk                                       (0x1UL << DAC_STS_DMAUDFLG2_Pos)                               /*!< 0x20000000 */
#define DAC_STS_DMAUDFLG2                                           DAC_STS_DMAUDFLG2_Msk                                          /*!<DAC channel2 DMA underrun flag */

/******************************************************************************/
/*                                                                            */
/*                                    DCI                                    */
/*                                                                            */
/******************************************************************************/
/********************  Bits definition for DCI_CTRL register  ******************/
#define DCI_CTRL_CEN_Pos                                            (0U)
#define DCI_CTRL_CEN_Msk                                            (0x1UL << DCI_CTRL_CEN_Pos)                                    /*!< 0x00000001 */
#define DCI_CTRL_CEN                                                DCI_CTRL_CEN_Msk
#define DCI_CTRL_CMODE_Pos                                          (1U)
#define DCI_CTRL_CMODE_Msk                                          (0x1UL << DCI_CTRL_CMODE_Pos)                                  /*!< 0x00000002 */
#define DCI_CTRL_CMODE                                              DCI_CTRL_CMODE_Msk
#define DCI_CTRL_CROPF_Pos                                          (2U)
#define DCI_CTRL_CROPF_Msk                                          (0x1UL << DCI_CTRL_CROPF_Pos)                                  /*!< 0x00000004 */
#define DCI_CTRL_CROPF                                              DCI_CTRL_CROPF_Msk
#define DCI_CTRL_JPGFM_Pos                                          (3U)
#define DCI_CTRL_JPGFM_Msk                                          (0x1UL << DCI_CTRL_JPGFM_Pos)                                  /*!< 0x00000008 */
#define DCI_CTRL_JPGFM                                              DCI_CTRL_JPGFM_Msk
#define DCI_CTRL_ESYNCSEL_Pos                                       (4U)
#define DCI_CTRL_ESYNCSEL_Msk                                       (0x1UL << DCI_CTRL_ESYNCSEL_Pos)                               /*!< 0x00000010 */
#define DCI_CTRL_ESYNCSEL                                           DCI_CTRL_ESYNCSEL_Msk
#define DCI_CTRL_PXCLKPOL_Pos                                       (5U)
#define DCI_CTRL_PXCLKPOL_Msk                                       (0x1UL << DCI_CTRL_PXCLKPOL_Pos)                               /*!< 0x00000020 */
#define DCI_CTRL_PXCLKPOL                                           DCI_CTRL_PXCLKPOL_Msk
#define DCI_CTRL_HSYNCPOL_Pos                                       (6U)
#define DCI_CTRL_HSYNCPOL_Msk                                       (0x1UL << DCI_CTRL_HSYNCPOL_Pos)                               /*!< 0x00000040 */
#define DCI_CTRL_HSYNCPOL                                           DCI_CTRL_HSYNCPOL_Msk
#define DCI_CTRL_VSYNCPOL_Pos                                       (7U)
#define DCI_CTRL_VSYNCPOL_Msk                                       (0x1UL << DCI_CTRL_VSYNCPOL_Pos)                               /*!< 0x00000080 */
#define DCI_CTRL_VSYNCPOL                                           DCI_CTRL_VSYNCPOL_Msk
#define DCI_CTRL_FCRCFG_0                                           0x00000100U
#define DCI_CTRL_FCRCFG_1                                           0x00000200U
#define DCI_CTRL_EXDMOD_0                                           0x00000400U
#define DCI_CTRL_EXDMOD_1                                           0x00000800U
#define DCI_CTRL_DCIEN_Pos                                          (14U)
#define DCI_CTRL_DCIEN_Msk                                          (0x1UL << DCI_CTRL_DCIEN_Pos)                                  /*!< 0x00004000 */
#define DCI_CTRL_DCIEN                                              DCI_CTRL_DCIEN_Msk

/********************  Bits definition for DCI_STS register  ******************/
#define DCI_STS_HSYNCSTS_Pos                                        (0U)
#define DCI_STS_HSYNCSTS_Msk                                        (0x1UL << DCI_STS_HSYNCSTS_Pos)                                /*!< 0x00000001 */
#define DCI_STS_HSYNCSTS                                            DCI_STS_HSYNCSTS_Msk
#define DCI_STS_VSYNCSTS_Pos                                        (1U)
#define DCI_STS_VSYNCSTS_Msk                                        (0x1UL << DCI_STS_VSYNCSTS_Pos)                                /*!< 0x00000002 */
#define DCI_STS_VSYNCSTS                                            DCI_STS_VSYNCSTS_Msk
#define DCI_STS_FIFONEMP_Pos                                        (2U)
#define DCI_STS_FIFONEMP_Msk                                        (0x1UL << DCI_STS_FIFONEMP_Pos)                                /*!< 0x00000004 */
#define DCI_STS_FIFONEMP                                            DCI_STS_FIFONEMP_Msk

/********************  Bits definition for DCI_RIS register  *****************/
#define DCI_RIS_FRAME_RIS_Pos                                       (0U)
#define DCI_RIS_FRAME_RIS_Msk                                       (0x1UL << DCI_RIS_FRAME_RIS_Pos)                               /*!< 0x00000001 */
#define DCI_RIS_FRAME_RIS                                           DCI_RIS_FRAME_RIS_Msk
#define DCI_RIS_OVR_RIS_Pos                                         (1U)
#define DCI_RIS_OVR_RIS_Msk                                         (0x1UL << DCI_RIS_OVR_RIS_Pos)                                 /*!< 0x00000002 */
#define DCI_RIS_OVR_RIS                                             DCI_RIS_OVR_RIS_Msk
#define DCI_RIS_ERR_RIS_Pos                                         (2U)
#define DCI_RIS_ERR_RIS_Msk                                         (0x1UL << DCI_RIS_ERR_RIS_Pos)                                 /*!< 0x00000004 */
#define DCI_RIS_ERR_RIS                                             DCI_RIS_ERR_RIS_Msk
#define DCI_RIS_VSYNC_RIS_Pos                                       (3U)
#define DCI_RIS_VSYNC_RIS_Msk                                       (0x1UL << DCI_RIS_VSYNC_RIS_Pos)                               /*!< 0x00000008 */
#define DCI_RIS_VSYNC_RIS                                           DCI_RIS_VSYNC_RIS_Msk
#define DCI_RIS_LINE_RIS_Pos                                        (4U)
#define DCI_RIS_LINE_RIS_Msk                                        (0x1UL << DCI_RIS_LINE_RIS_Pos)                                /*!< 0x00000010 */
#define DCI_RIS_LINE_RIS                                            DCI_RIS_LINE_RIS_Msk
/* Legacy defines */
#define DCI_RINTSTS_CC_RINT_RIS                                     DCI_RIS_FRAME_RIS
#define DCI_RINTSTS_OVR_RINT_RIS                                    DCI_RIS_OVR_RIS
#define DCI_RINTSTS_SYNCERR_RINT_RIS                                DCI_RIS_ERR_RIS
#define DCI_RINTSTS_VSYNC_RINT_RIS                                  DCI_RIS_VSYNC_RIS
#define DCI_RINTSTS_LINE_RINT_RIS                                   DCI_RIS_LINE_RIS
#define DCI_RINTSTS_OVF_RINT_RIS                                    DCI_RIS_OVR_RIS

/********************  Bits definition for DCI_INTEN register  *****************/
#define DCI_INTEN_CCINTEN_Pos                                       (0U)
#define DCI_INTEN_CCINTEN_Msk                                       (0x1UL << DCI_INTEN_CCINTEN_Pos)                               /*!< 0x00000001 */
#define DCI_INTEN_CCINTEN                                           DCI_INTEN_CCINTEN_Msk
#define DCI_INTEN_OVRINTEN_Pos                                      (1U)
#define DCI_INTEN_OVRINTEN_Msk                                      (0x1UL << DCI_INTEN_OVRINTEN_Pos)                              /*!< 0x00000002 */
#define DCI_INTEN_OVRINTEN                                          DCI_INTEN_OVRINTEN_Msk
#define DCI_INTEN_SYNCERRINTEN_Pos                                  (2U)
#define DCI_INTEN_SYNCERRINTEN_Msk                                  (0x1UL << DCI_INTEN_SYNCERRINTEN_Pos)                          /*!< 0x00000004 */
#define DCI_INTEN_SYNCERRINTEN                                      DCI_INTEN_SYNCERRINTEN_Msk
#define DCI_INTEN_VSYNCINTEN_Pos                                    (3U)
#define DCI_INTEN_VSYNCINTEN_Msk                                    (0x1UL << DCI_INTEN_VSYNCINTEN_Pos)                            /*!< 0x00000008 */
#define DCI_INTEN_VSYNCINTEN                                        DCI_INTEN_VSYNCINTEN_Msk
#define DCI_INTEN_LINEINTEN_Pos                                     (4U)
#define DCI_INTEN_LINEINTEN_Msk                                     (0x1UL << DCI_INTEN_LINEINTEN_Pos)                             /*!< 0x00000010 */
#define DCI_INTEN_LINEINTEN                                         DCI_INTEN_LINEINTEN_Msk
/* Legacy defines */
#define DCI_INTEN_OVF_IE                                            DCI_INTEN_OVRINTEN

/********************  Bits definition for DCI_MIS register  *****************/
#define DCI_MIS_FRAME_MIS_Pos                                       (0U)
#define DCI_MIS_FRAME_MIS_Msk                                       (0x1UL << DCI_MIS_FRAME_MIS_Pos)                               /*!< 0x00000001 */
#define DCI_MIS_FRAME_MIS                                           DCI_MIS_FRAME_MIS_Msk
#define DCI_MIS_OVR_MIS_Pos                                         (1U)
#define DCI_MIS_OVR_MIS_Msk                                         (0x1UL << DCI_MIS_OVR_MIS_Pos)                                 /*!< 0x00000002 */
#define DCI_MIS_OVR_MIS                                             DCI_MIS_OVR_MIS_Msk
#define DCI_MIS_ERR_MIS_Pos                                         (2U)
#define DCI_MIS_ERR_MIS_Msk                                         (0x1UL << DCI_MIS_ERR_MIS_Pos)                                 /*!< 0x00000004 */
#define DCI_MIS_ERR_MIS                                             DCI_MIS_ERR_MIS_Msk
#define DCI_MIS_VSYNC_MIS_Pos                                       (3U)
#define DCI_MIS_VSYNC_MIS_Msk                                       (0x1UL << DCI_MIS_VSYNC_MIS_Pos)                               /*!< 0x00000008 */
#define DCI_MIS_VSYNC_MIS                                           DCI_MIS_VSYNC_MIS_Msk
#define DCI_MIS_LINE_MIS_Pos                                        (4U)
#define DCI_MIS_LINE_MIS_Msk                                        (0x1UL << DCI_MIS_LINE_MIS_Pos)                                /*!< 0x00000010 */
#define DCI_MIS_LINE_MIS                                            DCI_MIS_LINE_MIS_Msk

