betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f407xx.h
/* Legacy defines */
#define DCI_MINTSTS_CC_MINT_MIS                                     DCI_MIS_FRAME_MIS
#define DCI_MINTSTS_OVR_MINT_MIS                                    DCI_MIS_OVR_MIS
#define DCI_MINTSTS_SYNCERR_MINT_MIS                                DCI_MIS_ERR_MIS
#define DCI_MINTSTS_VSYNC_MINT_MIS                                  DCI_MIS_VSYNC_MIS
#define DCI_MINTSTS_LINE_MINT_MIS                                   DCI_MIS_LINE_MIS

/********************  Bits definition for DCI_INTCLR register  *****************/
#define DCI_INTCLR_CC_INTCLR_Pos                                    (0U)
#define DCI_INTCLR_CC_INTCLR_Msk                                    (0x1UL << DCI_INTCLR_CC_INTCLR_Pos)                            /*!< 0x00000001 */
#define DCI_INTCLR_CC_INTCLR                                        DCI_INTCLR_CC_INTCLR_Msk
#define DCI_INTCLR_OVR_INTCLR_Pos                                   (1U)
#define DCI_INTCLR_OVR_INTCLR_Msk                                   (0x1UL << DCI_INTCLR_OVR_INTCLR_Pos)                           /*!< 0x00000002 */
#define DCI_INTCLR_OVR_INTCLR                                       DCI_INTCLR_OVR_INTCLR_Msk
#define DCI_INTCLR_SYNCERR_INTCLR_Pos                               (2U)
#define DCI_INTCLR_SYNCERR_INTCLR_Msk                               (0x1UL << DCI_INTCLR_SYNCERR_INTCLR_Pos)                       /*!< 0x00000004 */
#define DCI_INTCLR_SYNCERR_INTCLR                                   DCI_INTCLR_SYNCERR_INTCLR_Msk
#define DCI_INTCLR_VSYNC_INTCLR_Pos                                 (3U)
#define DCI_INTCLR_VSYNC_INTCLR_Msk                                 (0x1UL << DCI_INTCLR_VSYNC_INTCLR_Pos)                         /*!< 0x00000008 */
#define DCI_INTCLR_VSYNC_INTCLR                                     DCI_INTCLR_VSYNC_INTCLR_Msk
#define DCI_INTCLR_LINE_INTCLR_Pos                                  (4U)
#define DCI_INTCLR_LINE_INTCLR_Msk                                  (0x1UL << DCI_INTCLR_LINE_INTCLR_Pos)                          /*!< 0x00000010 */
#define DCI_INTCLR_LINE_INTCLR                                      DCI_INTCLR_LINE_INTCLR_Msk

/* Legacy defines */
#define DCI_INTCLR_OVF_INTCLR                                       DCI_INTCLR_OVR_INTCLR

/********************  Bits definition for DCI_ESYNCC register  ******************/
#define DCI_ESYNCC_FSDC_Pos                                         (0U)
#define DCI_ESYNCC_FSDC_Msk                                         (0xFFUL << DCI_ESYNCC_FSDC_Pos)                                /*!< 0x000000FF */
#define DCI_ESYNCC_FSDC                                             DCI_ESYNCC_FSDC_Msk
#define DCI_ESYNCC_LSDC_Pos                                         (8U)
#define DCI_ESYNCC_LSDC_Msk                                         (0xFFUL << DCI_ESYNCC_LSDC_Pos)                                /*!< 0x0000FF00 */
#define DCI_ESYNCC_LSDC                                             DCI_ESYNCC_LSDC_Msk
#define DCI_ESYNCC_LEDC_Pos                                         (16U)
#define DCI_ESYNCC_LEDC_Msk                                         (0xFFUL << DCI_ESYNCC_LEDC_Pos)                                /*!< 0x00FF0000 */
#define DCI_ESYNCC_LEDC                                             DCI_ESYNCC_LEDC_Msk
#define DCI_ESYNCC_FEDC_Pos                                         (24U)
#define DCI_ESYNCC_FEDC_Msk                                         (0xFFUL << DCI_ESYNCC_FEDC_Pos)                                /*!< 0xFF000000 */
#define DCI_ESYNCC_FEDC                                             DCI_ESYNCC_FEDC_Msk

/********************  Bits definition for DCI_ESYNCUM register  ******************/
#define DCI_ESYNCUM_FSDUM_Pos                                       (0U)
#define DCI_ESYNCUM_FSDUM_Msk                                       (0xFFUL << DCI_ESYNCUM_FSDUM_Pos)                              /*!< 0x000000FF */
#define DCI_ESYNCUM_FSDUM                                           DCI_ESYNCUM_FSDUM_Msk
#define DCI_ESYNCUM_LSDUM_Pos                                       (8U)
#define DCI_ESYNCUM_LSDUM_Msk                                       (0xFFUL << DCI_ESYNCUM_LSDUM_Pos)                              /*!< 0x0000FF00 */
#define DCI_ESYNCUM_LSDUM                                           DCI_ESYNCUM_LSDUM_Msk
#define DCI_ESYNCUM_LEDUM_Pos                                       (16U)
#define DCI_ESYNCUM_LEDUM_Msk                                       (0xFFUL << DCI_ESYNCUM_LEDUM_Pos)                              /*!< 0x00FF0000 */
#define DCI_ESYNCUM_LEDUM                                           DCI_ESYNCUM_LEDUM_Msk
#define DCI_ESYNCUM_FEDUM_Pos                                       (24U)
#define DCI_ESYNCUM_FEDUM_Msk                                       (0xFFUL << DCI_ESYNCUM_FEDUM_Pos)                              /*!< 0xFF000000 */
#define DCI_ESYNCUM_FEDUM                                           DCI_ESYNCUM_FEDUM_Msk

/********************  Bits definition for DCI_CROPWSTAT register  ******************/
#define DCI_CROPWSTAT_HOFSCNT_Pos                                   (0U)
#define DCI_CROPWSTAT_HOFSCNT_Msk                                   (0x3FFFUL << DCI_CROPWSTAT_HOFSCNT_Pos)                        /*!< 0x00003FFF */
#define DCI_CROPWSTAT_HOFSCNT                                       DCI_CROPWSTAT_HOFSCNT_Msk
#define DCI_CROPWSTAT_VSLINECNT_Pos                                 (16U)
#define DCI_CROPWSTAT_VSLINECNT_Msk                                 (0x1FFFUL << DCI_CROPWSTAT_VSLINECNT_Pos)                      /*!< 0x1FFF0000 */
#define DCI_CROPWSTAT_VSLINECNT                                     DCI_CROPWSTAT_VSLINECNT_Msk

/********************  Bits definition for DCI_CROPWSIZE register  ******************/
#define DCI_CROPWSIZE_CCNT_Pos                                      (0U)
#define DCI_CROPWSIZE_CCNT_Msk                                      (0x3FFFUL << DCI_CROPWSIZE_CCNT_Pos)                           /*!< 0x00003FFF */
#define DCI_CROPWSIZE_CCNT                                          DCI_CROPWSIZE_CCNT_Msk
#define DCI_CROPWSIZE_VLINECNT_Pos                                  (16U)
#define DCI_CROPWSIZE_VLINECNT_Msk                                  (0x3FFFUL << DCI_CROPWSIZE_VLINECNT_Pos)                       /*!< 0x3FFF0000 */
#define DCI_CROPWSIZE_VLINECNT                                      DCI_CROPWSIZE_VLINECNT_Msk

/********************  Bits definition for DCI_DATA register  *********************/
#define DCI_DATA_DATA0_Pos                                          (0U)
#define DCI_DATA_DATA0_Msk                                          (0xFFUL << DCI_DATA_DATA0_Pos)                                 /*!< 0x000000FF */
#define DCI_DATA_DATA0                                              DCI_DATA_DATA0_Msk
#define DCI_DATA_DATA1_Pos                                          (8U)
#define DCI_DATA_DATA1_Msk                                          (0xFFUL << DCI_DATA_DATA1_Pos)                                 /*!< 0x0000FF00 */
#define DCI_DATA_DATA1                                              DCI_DATA_DATA1_Msk
#define DCI_DATA_DATA2_Pos                                          (16U)
#define DCI_DATA_DATA2_Msk                                          (0xFFUL << DCI_DATA_DATA2_Pos)                                 /*!< 0x00FF0000 */
#define DCI_DATA_DATA2                                              DCI_DATA_DATA2_Msk
#define DCI_DATA_DATA3_Pos                                          (24U)
#define DCI_DATA_DATA3_Msk                                          (0xFFUL << DCI_DATA_DATA3_Pos)                                 /*!< 0xFF000000 */
#define DCI_DATA_DATA3                                              DCI_DATA_DATA3_Msk

/******************************************************************************/
/*                                                                            */
/*                             DMA Controller                                 */
/*                                                                            */
/******************************************************************************/
/********************  Bits definition for DMA_SCFGx register  *****************/
#define DMA_SCFGx_CHSEL_Pos                                         (25U)
#define DMA_SCFGx_CHSEL_Msk                                         (0x7UL << DMA_SCFGx_CHSEL_Pos)                                 /*!< 0x0E000000 */
#define DMA_SCFGx_CHSEL                                             DMA_SCFGx_CHSEL_Msk
#define DMA_SCFGx_CHSEL_0                                           0x02000000U
#define DMA_SCFGx_CHSEL_1                                           0x04000000U
#define DMA_SCFGx_CHSEL_2                                           0x08000000U
#define DMA_SCFGx_MBCFG_Pos                                         (23U)
#define DMA_SCFGx_MBCFG_Msk                                         (0x3UL << DMA_SCFGx_MBCFG_Pos)                                 /*!< 0x01800000 */
#define DMA_SCFGx_MBCFG                                             DMA_SCFGx_MBCFG_Msk
#define DMA_SCFGx_MBCFG_0                                           (0x1UL << DMA_SCFGx_MBCFG_Pos)                                 /*!< 0x00800000 */
#define DMA_SCFGx_MBCFG_1                                           (0x2UL << DMA_SCFGx_MBCFG_Pos)                                 /*!< 0x01000000 */
#define DMA_SCFGx_PBCFG_Pos                                         (21U)
#define DMA_SCFGx_PBCFG_Msk                                         (0x3UL << DMA_SCFGx_PBCFG_Pos)                                 /*!< 0x00600000 */
#define DMA_SCFGx_PBCFG                                             DMA_SCFGx_PBCFG_Msk
#define DMA_SCFGx_PBCFG_0                                           (0x1UL << DMA_SCFGx_PBCFG_Pos)                                 /*!< 0x00200000 */
#define DMA_SCFGx_PBCFG_1                                           (0x2UL << DMA_SCFGx_PBCFG_Pos)                                 /*!< 0x00400000 */
#define DMA_SCFGx_CTARG_Pos                                         (19U)
#define DMA_SCFGx_CTARG_Msk                                         (0x1UL << DMA_SCFGx_CTARG_Pos)                                 /*!< 0x00080000 */
#define DMA_SCFGx_CTARG                                             DMA_SCFGx_CTARG_Msk
#define DMA_SCFGx_DBM_Pos                                           (18U)
#define DMA_SCFGx_DBM_Msk                                           (0x1UL << DMA_SCFGx_DBM_Pos)                                   /*!< 0x00040000 */
#define DMA_SCFGx_DBM                                               DMA_SCFGx_DBM_Msk
#define DMA_SCFGx_PRILCFG_Pos                                       (16U)
#define DMA_SCFGx_PRILCFG_Msk                                       (0x3UL << DMA_SCFGx_PRILCFG_Pos)                               /*!< 0x00030000 */
#define DMA_SCFGx_PRILCFG                                           DMA_SCFGx_PRILCFG_Msk
#define DMA_SCFGx_PRILCFG_0                                         (0x1UL << DMA_SCFGx_PRILCFG_Pos)                               /*!< 0x00010000 */
#define DMA_SCFGx_PRILCFG_1                                         (0x2UL << DMA_SCFGx_PRILCFG_Pos)                               /*!< 0x00020000 */
#define DMA_SCFGx_PERIOSIZE_Pos                                     (15U)
#define DMA_SCFGx_PERIOSIZE_Msk                                     (0x1UL << DMA_SCFGx_PERIOSIZE_Pos)                             /*!< 0x00008000 */
#define DMA_SCFGx_PERIOSIZE                                         DMA_SCFGx_PERIOSIZE_Msk
#define DMA_SCFGx_MEMSIZECFG_Pos                                    (13U)
#define DMA_SCFGx_MEMSIZECFG_Msk                                    (0x3UL << DMA_SCFGx_MEMSIZECFG_Pos)                            /*!< 0x00006000 */
#define DMA_SCFGx_MEMSIZECFG                                        DMA_SCFGx_MEMSIZECFG_Msk
#define DMA_SCFGx_MEMSIZECFG_0                                      (0x1UL << DMA_SCFGx_MEMSIZECFG_Pos)                            /*!< 0x00002000 */
#define DMA_SCFGx_MEMSIZECFG_1                                      (0x2UL << DMA_SCFGx_MEMSIZECFG_Pos)                            /*!< 0x00004000 */
#define DMA_SCFGx_PERSIZECFG_Pos                                    (11U)
#define DMA_SCFGx_PERSIZECFG_Msk                                    (0x3UL << DMA_SCFGx_PERSIZECFG_Pos)                            /*!< 0x00001800 */
#define DMA_SCFGx_PERSIZECFG                                        DMA_SCFGx_PERSIZECFG_Msk
#define DMA_SCFGx_PERSIZECFG_0                                      (0x1UL << DMA_SCFGx_PERSIZECFG_Pos)                            /*!< 0x00000800 */
#define DMA_SCFGx_PERSIZECFG_1                                      (0x2UL << DMA_SCFGx_PERSIZECFG_Pos)                            /*!< 0x00001000 */
#define DMA_SCFGx_MEMIM_Pos                                         (10U)
#define DMA_SCFGx_MEMIM_Msk                                         (0x1UL << DMA_SCFGx_MEMIM_Pos)                                 /*!< 0x00000400 */
#define DMA_SCFGx_MEMIM                                             DMA_SCFGx_MEMIM_Msk
#define DMA_SCFGx_PERIM_Pos                                         (9U)
#define DMA_SCFGx_PERIM_Msk                                         (0x1UL << DMA_SCFGx_PERIM_Pos)                                 /*!< 0x00000200 */
#define DMA_SCFGx_PERIM                                             DMA_SCFGx_PERIM_Msk
#define DMA_SCFGx_CIRCMEN_Pos                                       (8U)
#define DMA_SCFGx_CIRCMEN_Msk                                       (0x1UL << DMA_SCFGx_CIRCMEN_Pos)                               /*!< 0x00000100 */
#define DMA_SCFGx_CIRCMEN                                           DMA_SCFGx_CIRCMEN_Msk
#define DMA_SCFGx_DIRCFG_Pos                                        (6U)
#define DMA_SCFGx_DIRCFG_Msk                                        (0x3UL << DMA_SCFGx_DIRCFG_Pos)                                /*!< 0x000000C0 */
#define DMA_SCFGx_DIRCFG                                            DMA_SCFGx_DIRCFG_Msk
#define DMA_SCFGx_DIRCFG_0                                          (0x1UL << DMA_SCFGx_DIRCFG_Pos)                                /*!< 0x00000040 */
#define DMA_SCFGx_DIRCFG_1                                          (0x2UL << DMA_SCFGx_DIRCFG_Pos)                                /*!< 0x00000080 */
#define DMA_SCFGx_PERFC_Pos                                         (5U)
#define DMA_SCFGx_PERFC_Msk                                         (0x1UL << DMA_SCFGx_PERFC_Pos)                                 /*!< 0x00000020 */
#define DMA_SCFGx_PERFC                                             DMA_SCFGx_PERFC_Msk
#define DMA_SCFGx_TXCIEN_Pos                                        (4U)
#define DMA_SCFGx_TXCIEN_Msk                                        (0x1UL << DMA_SCFGx_TXCIEN_Pos)                                /*!< 0x00000010 */
#define DMA_SCFGx_TXCIEN                                            DMA_SCFGx_TXCIEN_Msk
#define DMA_SCFGx_HTXIEN_Pos                                        (3U)
#define DMA_SCFGx_HTXIEN_Msk                                        (0x1UL << DMA_SCFGx_HTXIEN_Pos)                                /*!< 0x00000008 */
#define DMA_SCFGx_HTXIEN                                            DMA_SCFGx_HTXIEN_Msk
#define DMA_SCFGx_TXEIEN_Pos                                        (2U)
#define DMA_SCFGx_TXEIEN_Msk                                        (0x1UL << DMA_SCFGx_TXEIEN_Pos)                                /*!< 0x00000004 */
#define DMA_SCFGx_TXEIEN                                            DMA_SCFGx_TXEIEN_Msk
#define DMA_SCFGx_DMEIEN_Pos                                        (1U)
#define DMA_SCFGx_DMEIEN_Msk                                        (0x1UL << DMA_SCFGx_DMEIEN_Pos)                                /*!< 0x00000002 */
#define DMA_SCFGx_DMEIEN                                            DMA_SCFGx_DMEIEN_Msk
#define DMA_SCFGx_EN_Pos                                            (0U)
#define DMA_SCFGx_EN_Msk                                            (0x1UL << DMA_SCFGx_EN_Pos)                                    /*!< 0x00000001 */
#define DMA_SCFGx_EN                                                DMA_SCFGx_EN_Msk

