betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f407xx.h
/*******************  Bits definition for FMC_OPTCTRL register  ***************/
#define FLASH_OPTCTRL_OPTLOCK_Pos                                   (0U)
#define FLASH_OPTCTRL_OPTLOCK_Msk                                   (0x1UL << FLASH_OPTCTRL_OPTLOCK_Pos)                           /*!< 0x00000001 */
#define FLASH_OPTCTRL_OPTLOCK                                       FLASH_OPTCTRL_OPTLOCK_Msk
#define FLASH_OPTCTRL_OPTSTART_Pos                                  (1U)
#define FLASH_OPTCTRL_OPTSTART_Msk                                  (0x1UL << FLASH_OPTCTRL_OPTSTART_Pos)                          /*!< 0x00000002 */
#define FLASH_OPTCTRL_OPTSTART                                      FLASH_OPTCTRL_OPTSTART_Msk

#define FLASH_OPTCTRL_BORLVL_0                                      0x00000004U
#define FLASH_OPTCTRL_BORLVL_1                                      0x00000008U
#define FLASH_OPTCTRL_BORLVL_Pos                                    (2U)
#define FLASH_OPTCTRL_BORLVL_Msk                                    (0x3UL << FLASH_OPTCTRL_BORLVL_Pos)                            /*!< 0x0000000C */
#define FLASH_OPTCTRL_BORLVL                                        FLASH_OPTCTRL_BORLVL_Msk
#define FLASH_OPTCTRL_WDTSEL_Pos                                    (5U)
#define FLASH_OPTCTRL_WDTSEL_Msk                                    (0x1UL << FLASH_OPTCTRL_WDTSEL_Pos)                            /*!< 0x00000020 */
#define FLASH_OPTCTRL_WDTSEL                                        FLASH_OPTCTRL_WDTSEL_Msk
#define FLASH_OPTCTRL_RSTSTOP_Pos                                   (6U)
#define FLASH_OPTCTRL_RSTSTOP_Msk                                   (0x1UL << FLASH_OPTCTRL_RSTSTOP_Pos)                           /*!< 0x00000040 */
#define FLASH_OPTCTRL_RSTSTOP                                       FLASH_OPTCTRL_RSTSTOP_Msk
#define FLASH_OPTCTRL_RSTSTDB_Pos                                   (7U)
#define FLASH_OPTCTRL_RSTSTDB_Msk                                   (0x1UL << FLASH_OPTCTRL_RSTSTDB_Pos)                           /*!< 0x00000080 */
#define FLASH_OPTCTRL_RSTSTDB                                       FLASH_OPTCTRL_RSTSTDB_Msk
#define FLASH_OPTCTRL_RPROT_Pos                                     (8U)
#define FLASH_OPTCTRL_RPROT_Msk                                     (0xFFUL << FLASH_OPTCTRL_RPROT_Pos)                            /*!< 0x0000FF00 */
#define FLASH_OPTCTRL_RPROT                                         FLASH_OPTCTRL_RPROT_Msk
#define FLASH_OPTCTRL_RPROT_0                                       (0x01UL << FLASH_OPTCTRL_RPROT_Pos)                            /*!< 0x00000100 */
#define FLASH_OPTCTRL_RPROT_1                                       (0x02UL << FLASH_OPTCTRL_RPROT_Pos)                            /*!< 0x00000200 */
#define FLASH_OPTCTRL_RPROT_2                                       (0x04UL << FLASH_OPTCTRL_RPROT_Pos)                            /*!< 0x00000400 */
#define FLASH_OPTCTRL_RPROT_3                                       (0x08UL << FLASH_OPTCTRL_RPROT_Pos)                            /*!< 0x00000800 */
#define FLASH_OPTCTRL_RPROT_4                                       (0x10UL << FLASH_OPTCTRL_RPROT_Pos)                            /*!< 0x00001000 */
#define FLASH_OPTCTRL_RPROT_5                                       (0x20UL << FLASH_OPTCTRL_RPROT_Pos)                            /*!< 0x00002000 */
#define FLASH_OPTCTRL_RPROT_6                                       (0x40UL << FLASH_OPTCTRL_RPROT_Pos)                            /*!< 0x00004000 */
#define FLASH_OPTCTRL_RPROT_7                                       (0x80UL << FLASH_OPTCTRL_RPROT_Pos)                            /*!< 0x00008000 */
#define FLASH_OPTCTRL_NWPROT_Pos                                    (16U)
#define FLASH_OPTCTRL_NWPROT_Msk                                    (0xFFFUL << FLASH_OPTCTRL_NWPROT_Pos)                          /*!< 0x0FFF0000 */
#define FLASH_OPTCTRL_NWPROT                                        FLASH_OPTCTRL_NWPROT_Msk
#define FLASH_OPTCTRL_NWPROT_0                                      0x00010000U
#define FLASH_OPTCTRL_NWPROT_1                                      0x00020000U
#define FLASH_OPTCTRL_NWPROT_2                                      0x00040000U
#define FLASH_OPTCTRL_NWPROT_3                                      0x00080000U
#define FLASH_OPTCTRL_NWPROT_4                                      0x00100000U
#define FLASH_OPTCTRL_NWPROT_5                                      0x00200000U
#define FLASH_OPTCTRL_NWPROT_6                                      0x00400000U
#define FLASH_OPTCTRL_NWPROT_7                                      0x00800000U
#define FLASH_OPTCTRL_NWPROT_8                                      0x01000000U
#define FLASH_OPTCTRL_NWPROT_9                                      0x02000000U
#define FLASH_OPTCTRL_NWPROT_10                                     0x04000000U
#define FLASH_OPTCTRL_NWPROT_11                                     0x08000000U

/******************  Bits definition for FMC_OPTCTRL1 register  ***************/
#define FLASH_OPTCTRL1_NWPROT_Pos                                   (16U)
#define FLASH_OPTCTRL1_NWPROT_Msk                                   (0xFFFUL << FLASH_OPTCTRL1_NWPROT_Pos)                         /*!< 0x0FFF0000 */
#define FLASH_OPTCTRL1_NWPROT                                       FLASH_OPTCTRL1_NWPROT_Msk
#define FLASH_OPTCTRL1_NWPROT_0                                     (0x001UL << FLASH_OPTCTRL1_NWPROT_Pos)                         /*!< 0x00010000 */
#define FLASH_OPTCTRL1_NWPROT_1                                     (0x002UL << FLASH_OPTCTRL1_NWPROT_Pos)                         /*!< 0x00020000 */
#define FLASH_OPTCTRL1_NWPROT_2                                     (0x004UL << FLASH_OPTCTRL1_NWPROT_Pos)                         /*!< 0x00040000 */
#define FLASH_OPTCTRL1_NWPROT_3                                     (0x008UL << FLASH_OPTCTRL1_NWPROT_Pos)                         /*!< 0x00080000 */
#define FLASH_OPTCTRL1_NWPROT_4                                     (0x010UL << FLASH_OPTCTRL1_NWPROT_Pos)                         /*!< 0x00100000 */
#define FLASH_OPTCTRL1_NWPROT_5                                     (0x020UL << FLASH_OPTCTRL1_NWPROT_Pos)                         /*!< 0x00200000 */
#define FLASH_OPTCTRL1_NWPROT_6                                     (0x040UL << FLASH_OPTCTRL1_NWPROT_Pos)                         /*!< 0x00400000 */
#define FLASH_OPTCTRL1_NWPROT_7                                     (0x080UL << FLASH_OPTCTRL1_NWPROT_Pos)                         /*!< 0x00800000 */
#define FLASH_OPTCTRL1_NWPROT_8                                     (0x100UL << FLASH_OPTCTRL1_NWPROT_Pos)                         /*!< 0x01000000 */
#define FLASH_OPTCTRL1_NWPROT_9                                     (0x200UL << FLASH_OPTCTRL1_NWPROT_Pos)                         /*!< 0x02000000 */
#define FLASH_OPTCTRL1_NWPROT_10                                    (0x400UL << FLASH_OPTCTRL1_NWPROT_Pos)                         /*!< 0x04000000 */
#define FLASH_OPTCTRL1_NWPROT_11                                    (0x800UL << FLASH_OPTCTRL1_NWPROT_Pos)                         /*!< 0x08000000 */

/******************************************************************************/
/*                                                                            */
/*                   Flexible Static Memory Controller                        */
/*                                                                            */
/******************************************************************************/
/******************  Bit definition for SMC_CSCTRL1 register  *******************/
#define SMC_CSCTRL1_MBKEN_Pos                                       (0U)
#define SMC_CSCTRL1_MBKEN_Msk                                       (0x1UL << SMC_CSCTRL1_MBKEN_Pos)                               /*!< 0x00000001 */
#define SMC_CSCTRL1_MBKEN                                           SMC_CSCTRL1_MBKEN_Msk                                          /*!<Memory bank enable bit                 */
#define SMC_CSCTRL1_ADMUXEN_Pos                                     (1U)
#define SMC_CSCTRL1_ADMUXEN_Msk                                     (0x1UL << SMC_CSCTRL1_ADMUXEN_Pos)                             /*!< 0x00000002 */
#define SMC_CSCTRL1_ADMUXEN                                         SMC_CSCTRL1_ADMUXEN_Msk                                        /*!<Address/data multiplexing enable bit   */

