betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f407xx.h
#define SMC_WRTTIM4_ASYNCACCCFG_Pos                                 (28U)
#define SMC_WRTTIM4_ASYNCACCCFG_Msk                                 (0x3UL << SMC_WRTTIM4_ASYNCACCCFG_Pos)                         /*!< 0x30000000 */
#define SMC_WRTTIM4_ASYNCACCCFG                                     SMC_WRTTIM4_ASYNCACCCFG_Msk                                    /*!<ACCMOD[1:0] bits (Access mode) */
#define SMC_WRTTIM4_ASYNCACCCFG_0                                   (0x1UL << SMC_WRTTIM4_ASYNCACCCFG_Pos)                         /*!< 0x10000000 */
#define SMC_WRTTIM4_ASYNCACCCFG_1                                   (0x2UL << SMC_WRTTIM4_ASYNCACCCFG_Pos)                         /*!< 0x20000000 */

/******************  Bit definition for SMC_CTRL2 register  *******************/
#define SMC_CTRL2_WAITFEN_Pos                                       (1U)
#define SMC_CTRL2_WAITFEN_Msk                                       (0x1UL << SMC_CTRL2_WAITFEN_Pos)                               /*!< 0x00000002 */
#define SMC_CTRL2_WAITFEN                                           SMC_CTRL2_WAITFEN_Msk                                          /*!<Wait feature enable bit */
#define SMC_CTRL2_MBKEN_Pos                                         (2U)
#define SMC_CTRL2_MBKEN_Msk                                         (0x1UL << SMC_CTRL2_MBKEN_Pos)                                 /*!< 0x00000004 */
#define SMC_CTRL2_MBKEN                                             SMC_CTRL2_MBKEN_Msk                                            /*!<PC Card/NAND Flash memory bank enable bit */
#define SMC_CTRL2_MTYPECFG_Pos                                      (3U)
#define SMC_CTRL2_MTYPECFG_Msk                                      (0x1UL << SMC_CTRL2_MTYPECFG_Pos)                              /*!< 0x00000008 */
#define SMC_CTRL2_MTYPECFG                                          SMC_CTRL2_MTYPECFG_Msk                                         /*!<Memory type */

#define SMC_CTRL2_DBWIDCFG_Pos                                      (4U)
#define SMC_CTRL2_DBWIDCFG_Msk                                      (0x3UL << SMC_CTRL2_DBWIDCFG_Pos)                              /*!< 0x00000030 */
#define SMC_CTRL2_DBWIDCFG                                          SMC_CTRL2_DBWIDCFG_Msk                                         /*!<PWID[1:0] bits (NAND Flash databus width) */
#define SMC_CTRL2_DBWIDCFG_0                                        (0x1UL << SMC_CTRL2_DBWIDCFG_Pos)                              /*!< 0x00000010 */
#define SMC_CTRL2_DBWIDCFG_1                                        (0x2UL << SMC_CTRL2_DBWIDCFG_Pos)                              /*!< 0x00000020 */

#define SMC_CTRL2_ECCEN_Pos                                         (6U)
#define SMC_CTRL2_ECCEN_Msk                                         (0x1UL << SMC_CTRL2_ECCEN_Pos)                                 /*!< 0x00000040 */
#define SMC_CTRL2_ECCEN                                             SMC_CTRL2_ECCEN_Msk                                            /*!<ECC computation logic enable bit */

#define SMC_CTRL2_C2RDCFG_Pos                                       (9U)
#define SMC_CTRL2_C2RDCFG_Msk                                       (0xFUL << SMC_CTRL2_C2RDCFG_Pos)                               /*!< 0x00001E00 */
#define SMC_CTRL2_C2RDCFG                                           SMC_CTRL2_C2RDCFG_Msk                                          /*!<TCLR[3:0] bits (CLE to RE delay) */
#define SMC_CTRL2_C2RDCFG_0                                         (0x1UL << SMC_CTRL2_C2RDCFG_Pos)                               /*!< 0x00000200 */
#define SMC_CTRL2_C2RDCFG_1                                         (0x2UL << SMC_CTRL2_C2RDCFG_Pos)                               /*!< 0x00000400 */
#define SMC_CTRL2_C2RDCFG_2                                         (0x4UL << SMC_CTRL2_C2RDCFG_Pos)                               /*!< 0x00000800 */
#define SMC_CTRL2_C2RDCFG_3                                         (0x8UL << SMC_CTRL2_C2RDCFG_Pos)                               /*!< 0x00001000 */

#define SMC_CTRL2_A2RDCFG_Pos                                       (13U)
#define SMC_CTRL2_A2RDCFG_Msk                                       (0xFUL << SMC_CTRL2_A2RDCFG_Pos)                               /*!< 0x0001E000 */
#define SMC_CTRL2_A2RDCFG                                           SMC_CTRL2_A2RDCFG_Msk                                          /*!<TAR[3:0] bits (ALE to RE delay) */
#define SMC_CTRL2_A2RDCFG_0                                         (0x1UL << SMC_CTRL2_A2RDCFG_Pos)                               /*!< 0x00002000 */
#define SMC_CTRL2_A2RDCFG_1                                         (0x2UL << SMC_CTRL2_A2RDCFG_Pos)                               /*!< 0x00004000 */
#define SMC_CTRL2_A2RDCFG_2                                         (0x4UL << SMC_CTRL2_A2RDCFG_Pos)                               /*!< 0x00008000 */
#define SMC_CTRL2_A2RDCFG_3                                         (0x8UL << SMC_CTRL2_A2RDCFG_Pos)                               /*!< 0x00010000 */

#define SMC_CTRL2_ECCPSCFG_Pos                                      (17U)
#define SMC_CTRL2_ECCPSCFG_Msk                                      (0x7UL << SMC_CTRL2_ECCPSCFG_Pos)                              /*!< 0x000E0000 */
#define SMC_CTRL2_ECCPSCFG                                          SMC_CTRL2_ECCPSCFG_Msk                                         /*!<ECCPS[1:0] bits (ECC page size) */
#define SMC_CTRL2_ECCPSCFG_0                                        (0x1UL << SMC_CTRL2_ECCPSCFG_Pos)                              /*!< 0x00020000 */
#define SMC_CTRL2_ECCPSCFG_1                                        (0x2UL << SMC_CTRL2_ECCPSCFG_Pos)                              /*!< 0x00040000 */
#define SMC_CTRL2_ECCPSCFG_2                                        (0x4UL << SMC_CTRL2_ECCPSCFG_Pos)                              /*!< 0x00080000 */

/******************  Bit definition for SMC_CTRL3 register  *******************/
#define SMC_CTRL3_WAITFEN_Pos                                       (1U)
#define SMC_CTRL3_WAITFEN_Msk                                       (0x1UL << SMC_CTRL3_WAITFEN_Pos)                               /*!< 0x00000002 */
#define SMC_CTRL3_WAITFEN                                           SMC_CTRL3_WAITFEN_Msk                                          /*!<Wait feature enable bit */
#define SMC_CTRL3_MBKEN_Pos                                         (2U)
#define SMC_CTRL3_MBKEN_Msk                                         (0x1UL << SMC_CTRL3_MBKEN_Pos)                                 /*!< 0x00000004 */
#define SMC_CTRL3_MBKEN                                             SMC_CTRL3_MBKEN_Msk                                            /*!<PC Card/NAND Flash memory bank enable bit */
#define SMC_CTRL3_MTYPECFG_Pos                                      (3U)
#define SMC_CTRL3_MTYPECFG_Msk                                      (0x1UL << SMC_CTRL3_MTYPECFG_Pos)                              /*!< 0x00000008 */
#define SMC_CTRL3_MTYPECFG                                          SMC_CTRL3_MTYPECFG_Msk                                         /*!<Memory type */

