betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f407xx.h
/******************  Bit definition for DMC_TIM1 register  ********************/
#define DMC_TIM1_STBTIM_Pos                                         (0U)
#define DMC_TIM1_STBTIM_Msk                                         (0xFFFFUL << DMC_TIM1_STBTIM_Pos)                              /*!< 0x0000FFFF */
#define DMC_TIM1_STBTIM                                             DMC_TIM1_STBTIM_Msk
#define DMC_TIM1_ARNUMCFG_Pos                                       (16U)
#define DMC_TIM1_ARNUMCFG_Msk                                       (0xFUL << DMC_TIM1_ARNUMCFG_Pos)                               /*!< 0x000F0000 */
#define DMC_TIM1_ARNUMCFG                                           DMC_TIM1_ARNUMCFG_Msk

/******************  Bit definition for DMC_CTRL1 register  ********************/
#define DMC_CTRL1_INIT_Pos                                          (0U)
#define DMC_CTRL1_INIT_Msk                                          (0x1UL << DMC_CTRL1_INIT_Pos)                                  /*!< 0x00000001 */
#define DMC_CTRL1_INIT                                              DMC_CTRL1_INIT_Msk
#define DMC_CTRL1_SRMEN_Pos                                         (1U)
#define DMC_CTRL1_SRMEN_Msk                                         (0x1UL << DMC_CTRL1_SRMEN_Pos)                                 /*!< 0x00000002 */
#define DMC_CTRL1_SRMEN                                             DMC_CTRL1_SRMEN_Msk
#define DMC_CTRL1_PDMEN_Pos                                         (2U)
#define DMC_CTRL1_PDMEN_Msk                                         (0x1UL << DMC_CTRL1_PDMEN_Pos)                                 /*!< 0x00000004 */
#define DMC_CTRL1_PDMEN                                             DMC_CTRL1_PDMEN_Msk
#define DMC_CTRL1_PCACFG_Pos                                        (3U)
#define DMC_CTRL1_PCACFG_Msk                                        (0x1UL << DMC_CTRL1_PCACFG_Pos)                                /*!< 0x00000008 */
#define DMC_CTRL1_PCACFG                                            DMC_CTRL1_PCACFG_Msk
#define DMC_CTRL1_FRBSREN_Pos                                       (4U)
#define DMC_CTRL1_FRBSREN_Msk                                       (0x1UL << DMC_CTRL1_FRBSREN_Pos)                               /*!< 0x00000010 */
#define DMC_CTRL1_FRBSREN                                           DMC_CTRL1_FRBSREN_Msk
#define DMC_CTRL1_FRASREN_Pos                                       (5U)
#define DMC_CTRL1_FRASREN_Msk                                       (0x1UL << DMC_CTRL1_FRASREN_Pos)                               /*!< 0x00000020 */
#define DMC_CTRL1_FRASREN                                           DMC_CTRL1_FRASREN_Msk
#define DMC_CTRL1_RDNUMMCFG_Pos                                     (6U)
#define DMC_CTRL1_RDNUMMCFG_Msk                                     (0x7UL << DMC_CTRL1_RDNUMMCFG_Pos)                             /*!< 0x000001C0 */
#define DMC_CTRL1_RDNUMMCFG                                         DMC_CTRL1_RDNUMMCFG_Msk
#define DMC_CTRL1_MODESET_Pos                                       (9U)
#define DMC_CTRL1_MODESET_Msk                                       (0x1UL << DMC_CTRL1_MODESET_Pos)                               /*!< 0x00000200 */
#define DMC_CTRL1_MODESET                                           DMC_CTRL1_MODESET_Msk
#define DMC_CTRL1_SRMFLG_Pos                                        (11U)
#define DMC_CTRL1_SRMFLG_Msk                                        (0x1UL << DMC_CTRL1_SRMFLG_Pos)                                /*!< 0x00000800 */
#define DMC_CTRL1_SRMFLG                                            DMC_CTRL1_SRMFLG_Msk
#define DMC_CTRL1_BANKNUMCFG_Pos                                    (12U)
#define DMC_CTRL1_BANKNUMCFG_Msk                                    (0xFUL << DMC_CTRL1_BANKNUMCFG_Pos)                            /*!< 0x0000F000 */
#define DMC_CTRL1_BANKNUMCFG                                        DMC_CTRL1_BANKNUMCFG_Msk

/******************  Bit definition for DMC_REF register  ********************/
#define DMC_REF_RCYCCFG_Pos                                         (0U)
#define DMC_REF_RCYCCFG_Msk                                         (0xFFFFUL << DMC_REF_RCYCCFG_Pos)                              /*!< 0x0000FFFF */
#define DMC_REF_RCYCCFG                                             DMC_REF_RCYCCFG_Msk

/******************  Bit definition for DMC_REF register  ********************/
#define DMC_SW_MCSW_Pos                                             (0U)
#define DMC_SW_MCSW_Msk                                             (0x1UL << DMC_SW_MCSW_Pos)                                     /*!< 0x00000001 */
#define DMC_SW_MCSW                                                 DMC_SW_MCSW_Msk

/******************  Bit definition for DMC_CTRL2 register  ********************/
#define DMC_CTRL2_CPHACFG_Pos                                       (0U)
#define DMC_CTRL2_CPHACFG_Msk                                       (0x1UL << DMC_CTRL2_CPHACFG_Pos)                               /*!< 0x00000001 */
#define DMC_CTRL2_CPHACFG                                           DMC_CTRL2_CPHACFG_Msk
#define DMC_CTRL2_RDDEN_Pos                                         (1U)
#define DMC_CTRL2_RDDEN_Msk                                         (0x1UL << DMC_CTRL2_RDDEN_Pos)                                 /*!< 0x00000002 */
#define DMC_CTRL2_RDDEN                                             DMC_CTRL2_RDDEN_Msk
#define DMC_CTRL2_RDDCFG_Pos                                        (2U)
#define DMC_CTRL2_RDDCFG_Msk                                        (0x7UL << DMC_CTRL2_RDDCFG_Pos)                                /*!< 0x0000001C */
#define DMC_CTRL2_RDDCFG                                            DMC_CTRL2_RDDCFG_Msk
#define DMC_CTRL2_WPEN_Pos                                          (5U)
#define DMC_CTRL2_WPEN_Msk                                          (0x1UL << DMC_CTRL2_WPEN_Pos)                                  /*!< 0x00000020 */
#define DMC_CTRL2_WPEN                                              DMC_CTRL2_WPEN_Msk
#define DMC_CTRL2_BUFFEN_Pos                                        (6U)
#define DMC_CTRL2_BUFFEN_Msk                                        (0x1UL << DMC_CTRL2_BUFFEN_Pos)                                /*!< 0x00000040 */
#define DMC_CTRL2_BUFFEN                                            DMC_CTRL2_BUFFEN_Msk
#define DMC_CTRL2_WRPBSEL_Pos                                       (7U)
#define DMC_CTRL2_WRPBSEL_Msk                                       (0x1UL << DMC_CTRL2_WRPBSEL_Pos)                               /*!< 0x00000080 */
#define DMC_CTRL2_WRPBSEL                                           DMC_CTRL2_WRPBSEL_Msk

/******************************************************************************/
/*                                                                            */
/*                            General Purpose I/O                             */
/*                                                                            */
/******************************************************************************/
/******************  Bits definition for GPIO_MODE register  *****************/
#define GPIO_MODE_MODE0_Pos                                         (0U)
#define GPIO_MODE_MODE0_Msk                                         (0x3UL << GPIO_MODE_MODE0_Pos)                                 /*!< 0x00000003 */
#define GPIO_MODE_MODE0                                             GPIO_MODE_MODE0_Msk
#define GPIO_MODE_MODE0_0                                           (0x1UL << GPIO_MODE_MODE0_Pos)                                 /*!< 0x00000001 */
#define GPIO_MODE_MODE0_1                                           (0x2UL << GPIO_MODE_MODE0_Pos)                                 /*!< 0x00000002 */
#define GPIO_MODE_MODE1_Pos                                         (2U)
#define GPIO_MODE_MODE1_Msk                                         (0x3UL << GPIO_MODE_MODE1_Pos)                                 /*!< 0x0000000C */
#define GPIO_MODE_MODE1                                             GPIO_MODE_MODE1_Msk
#define GPIO_MODE_MODE1_0                                           (0x1UL << GPIO_MODE_MODE1_Pos)                                 /*!< 0x00000004 */
#define GPIO_MODE_MODE1_1                                           (0x2UL << GPIO_MODE_MODE1_Pos)                                 /*!< 0x00000008 */
#define GPIO_MODE_MODE2_Pos                                         (4U)
#define GPIO_MODE_MODE2_Msk                                         (0x3UL << GPIO_MODE_MODE2_Pos)                                 /*!< 0x00000030 */
#define GPIO_MODE_MODE2                                             GPIO_MODE_MODE2_Msk
#define GPIO_MODE_MODE2_0                                           (0x1UL << GPIO_MODE_MODE2_Pos)                                 /*!< 0x00000010 */
#define GPIO_MODE_MODE2_1                                           (0x2UL << GPIO_MODE_MODE2_Pos)                                 /*!< 0x00000020 */
#define GPIO_MODE_MODE3_Pos                                         (6U)
#define GPIO_MODE_MODE3_Msk                                         (0x3UL << GPIO_MODE_MODE3_Pos)                                 /*!< 0x000000C0 */
#define GPIO_MODE_MODE3                                             GPIO_MODE_MODE3_Msk
#define GPIO_MODE_MODE3_0                                           (0x1UL << GPIO_MODE_MODE3_Pos)                                 /*!< 0x00000040 */
#define GPIO_MODE_MODE3_1                                           (0x2UL << GPIO_MODE_MODE3_Pos)                                 /*!< 0x00000080 */
#define GPIO_MODE_MODE4_Pos                                         (8U)
#define GPIO_MODE_MODE4_Msk                                         (0x3UL << GPIO_MODE_MODE4_Pos)                                 /*!< 0x00000300 */
#define GPIO_MODE_MODE4                                             GPIO_MODE_MODE4_Msk
#define GPIO_MODE_MODE4_0                                           (0x1UL << GPIO_MODE_MODE4_Pos)                                 /*!< 0x00000100 */
#define GPIO_MODE_MODE4_1                                           (0x2UL << GPIO_MODE_MODE4_Pos)                                 /*!< 0x00000200 */
#define GPIO_MODE_MODE5_Pos                                         (10U)
#define GPIO_MODE_MODE5_Msk                                         (0x3UL << GPIO_MODE_MODE5_Pos)                                 /*!< 0x00000C00 */
#define GPIO_MODE_MODE5                                             GPIO_MODE_MODE5_Msk
#define GPIO_MODE_MODE5_0                                           (0x1UL << GPIO_MODE_MODE5_Pos)                                 /*!< 0x00000400 */
#define GPIO_MODE_MODE5_1                                           (0x2UL << GPIO_MODE_MODE5_Pos)                                 /*!< 0x00000800 */
#define GPIO_MODE_MODE6_Pos                                         (12U)
#define GPIO_MODE_MODE6_Msk                                         (0x3UL << GPIO_MODE_MODE6_Pos)                                 /*!< 0x00003000 */
#define GPIO_MODE_MODE6                                             GPIO_MODE_MODE6_Msk
#define GPIO_MODE_MODE6_0                                           (0x1UL << GPIO_MODE_MODE6_Pos)                                 /*!< 0x00001000 */
#define GPIO_MODE_MODE6_1                                           (0x2UL << GPIO_MODE_MODE6_Pos)                                 /*!< 0x00002000 */
#define GPIO_MODE_MODE7_Pos                                         (14U)
#define GPIO_MODE_MODE7_Msk                                         (0x3UL << GPIO_MODE_MODE7_Pos)                                 /*!< 0x0000C000 */
#define GPIO_MODE_MODE7                                             GPIO_MODE_MODE7_Msk
#define GPIO_MODE_MODE7_0                                           (0x1UL << GPIO_MODE_MODE7_Pos)                                 /*!< 0x00004000 */
#define GPIO_MODE_MODE7_1                                           (0x2UL << GPIO_MODE_MODE7_Pos)                                 /*!< 0x00008000 */
#define GPIO_MODE_MODE8_Pos                                         (16U)
#define GPIO_MODE_MODE8_Msk                                         (0x3UL << GPIO_MODE_MODE8_Pos)                                 /*!< 0x00030000 */
#define GPIO_MODE_MODE8                                             GPIO_MODE_MODE8_Msk
#define GPIO_MODE_MODE8_0                                           (0x1UL << GPIO_MODE_MODE8_Pos)                                 /*!< 0x00010000 */
#define GPIO_MODE_MODE8_1                                           (0x2UL << GPIO_MODE_MODE8_Pos)                                 /*!< 0x00020000 */
#define GPIO_MODE_MODE9_Pos                                         (18U)
#define GPIO_MODE_MODE9_Msk                                         (0x3UL << GPIO_MODE_MODE9_Pos)                                 /*!< 0x000C0000 */
#define GPIO_MODE_MODE9                                             GPIO_MODE_MODE9_Msk
#define GPIO_MODE_MODE9_0                                           (0x1UL << GPIO_MODE_MODE9_Pos)                                 /*!< 0x00040000 */
#define GPIO_MODE_MODE9_1                                           (0x2UL << GPIO_MODE_MODE9_Pos)                                 /*!< 0x00080000 */
#define GPIO_MODE_MODE10_Pos                                        (20U)
#define GPIO_MODE_MODE10_Msk                                        (0x3UL << GPIO_MODE_MODE10_Pos)                                /*!< 0x00300000 */
#define GPIO_MODE_MODE10                                            GPIO_MODE_MODE10_Msk
#define GPIO_MODE_MODE10_0                                          (0x1UL << GPIO_MODE_MODE10_Pos)                                /*!< 0x00100000 */
#define GPIO_MODE_MODE10_1                                          (0x2UL << GPIO_MODE_MODE10_Pos)                                /*!< 0x00200000 */
#define GPIO_MODE_MODE11_Pos                                        (22U)
#define GPIO_MODE_MODE11_Msk                                        (0x3UL << GPIO_MODE_MODE11_Pos)                                /*!< 0x00C00000 */
#define GPIO_MODE_MODE11                                            GPIO_MODE_MODE11_Msk
#define GPIO_MODE_MODE11_0                                          (0x1UL << GPIO_MODE_MODE11_Pos)                                /*!< 0x00400000 */
#define GPIO_MODE_MODE11_1                                          (0x2UL << GPIO_MODE_MODE11_Pos)                                /*!< 0x00800000 */
#define GPIO_MODE_MODE12_Pos                                        (24U)
#define GPIO_MODE_MODE12_Msk                                        (0x3UL << GPIO_MODE_MODE12_Pos)                                /*!< 0x03000000 */
#define GPIO_MODE_MODE12                                            GPIO_MODE_MODE12_Msk
#define GPIO_MODE_MODE12_0                                          (0x1UL << GPIO_MODE_MODE12_Pos)                                /*!< 0x01000000 */
#define GPIO_MODE_MODE12_1                                          (0x2UL << GPIO_MODE_MODE12_Pos)                                /*!< 0x02000000 */
#define GPIO_MODE_MODE13_Pos                                        (26U)
#define GPIO_MODE_MODE13_Msk                                        (0x3UL << GPIO_MODE_MODE13_Pos)                                /*!< 0x0C000000 */
#define GPIO_MODE_MODE13                                            GPIO_MODE_MODE13_Msk
#define GPIO_MODE_MODE13_0                                          (0x1UL << GPIO_MODE_MODE13_Pos)                                /*!< 0x04000000 */
#define GPIO_MODE_MODE13_1                                          (0x2UL << GPIO_MODE_MODE13_Pos)                                /*!< 0x08000000 */
#define GPIO_MODE_MODE14_Pos                                        (28U)
#define GPIO_MODE_MODE14_Msk                                        (0x3UL << GPIO_MODE_MODE14_Pos)                                /*!< 0x30000000 */
#define GPIO_MODE_MODE14                                            GPIO_MODE_MODE14_Msk
#define GPIO_MODE_MODE14_0                                          (0x1UL << GPIO_MODE_MODE14_Pos)                                /*!< 0x10000000 */
#define GPIO_MODE_MODE14_1                                          (0x2UL << GPIO_MODE_MODE14_Pos)                                /*!< 0x20000000 */
#define GPIO_MODE_MODE15_Pos                                        (30U)
#define GPIO_MODE_MODE15_Msk                                        (0x3UL << GPIO_MODE_MODE15_Pos)                                /*!< 0xC0000000 */
#define GPIO_MODE_MODE15                                            GPIO_MODE_MODE15_Msk
#define GPIO_MODE_MODE15_0                                          (0x1UL << GPIO_MODE_MODE15_Pos)                                /*!< 0x40000000 */
#define GPIO_MODE_MODE15_1                                          (0x2UL << GPIO_MODE_MODE15_Pos)                                /*!< 0x80000000 */

/******************  Bits definition for GPIO_OMODE register  ****************/
#define GPIO_OMODE_OMODE0_Pos                                       (0U)
#define GPIO_OMODE_OMODE0_Msk                                       (0x1UL << GPIO_OMODE_OMODE0_Pos)                               /*!< 0x00000001 */
#define GPIO_OMODE_OMODE0                                           GPIO_OMODE_OMODE0_Msk
#define GPIO_OMODE_OMODE1_Pos                                       (1U)
#define GPIO_OMODE_OMODE1_Msk                                       (0x1UL << GPIO_OMODE_OMODE1_Pos)                               /*!< 0x00000002 */
#define GPIO_OMODE_OMODE1                                           GPIO_OMODE_OMODE1_Msk
#define GPIO_OMODE_OMODE2_Pos                                       (2U)
#define GPIO_OMODE_OMODE2_Msk                                       (0x1UL << GPIO_OMODE_OMODE2_Pos)                               /*!< 0x00000004 */
#define GPIO_OMODE_OMODE2                                           GPIO_OMODE_OMODE2_Msk
#define GPIO_OMODE_OMODE3_Pos                                       (3U)
#define GPIO_OMODE_OMODE3_Msk                                       (0x1UL << GPIO_OMODE_OMODE3_Pos)                               /*!< 0x00000008 */
#define GPIO_OMODE_OMODE3                                           GPIO_OMODE_OMODE3_Msk
#define GPIO_OMODE_OMODE4_Pos                                       (4U)
#define GPIO_OMODE_OMODE4_Msk                                       (0x1UL << GPIO_OMODE_OMODE4_Pos)                               /*!< 0x00000010 */
#define GPIO_OMODE_OMODE4                                           GPIO_OMODE_OMODE4_Msk
#define GPIO_OMODE_OMODE5_Pos                                       (5U)
#define GPIO_OMODE_OMODE5_Msk                                       (0x1UL << GPIO_OMODE_OMODE5_Pos)                               /*!< 0x00000020 */
#define GPIO_OMODE_OMODE5                                           GPIO_OMODE_OMODE5_Msk
#define GPIO_OMODE_OMODE6_Pos                                       (6U)
#define GPIO_OMODE_OMODE6_Msk                                       (0x1UL << GPIO_OMODE_OMODE6_Pos)                               /*!< 0x00000040 */
#define GPIO_OMODE_OMODE6                                           GPIO_OMODE_OMODE6_Msk
#define GPIO_OMODE_OMODE7_Pos                                       (7U)
#define GPIO_OMODE_OMODE7_Msk                                       (0x1UL << GPIO_OMODE_OMODE7_Pos)                               /*!< 0x00000080 */
#define GPIO_OMODE_OMODE7                                           GPIO_OMODE_OMODE7_Msk
#define GPIO_OMODE_OMODE8_Pos                                       (8U)
#define GPIO_OMODE_OMODE8_Msk                                       (0x1UL << GPIO_OMODE_OMODE8_Pos)                               /*!< 0x00000100 */
#define GPIO_OMODE_OMODE8                                           GPIO_OMODE_OMODE8_Msk
#define GPIO_OMODE_OMODE9_Pos                                       (9U)
#define GPIO_OMODE_OMODE9_Msk                                       (0x1UL << GPIO_OMODE_OMODE9_Pos)                               /*!< 0x00000200 */
#define GPIO_OMODE_OMODE9                                           GPIO_OMODE_OMODE9_Msk
#define GPIO_OMODE_OMODE10_Pos                                      (10U)
#define GPIO_OMODE_OMODE10_Msk                                      (0x1UL << GPIO_OMODE_OMODE10_Pos)                              /*!< 0x00000400 */
#define GPIO_OMODE_OMODE10                                          GPIO_OMODE_OMODE10_Msk
#define GPIO_OMODE_OMODE11_Pos                                      (11U)
#define GPIO_OMODE_OMODE11_Msk                                      (0x1UL << GPIO_OMODE_OMODE11_Pos)                              /*!< 0x00000800 */
#define GPIO_OMODE_OMODE11                                          GPIO_OMODE_OMODE11_Msk
#define GPIO_OMODE_OMODE12_Pos                                      (12U)
#define GPIO_OMODE_OMODE12_Msk                                      (0x1UL << GPIO_OMODE_OMODE12_Pos)                              /*!< 0x00001000 */
#define GPIO_OMODE_OMODE12                                          GPIO_OMODE_OMODE12_Msk
#define GPIO_OMODE_OMODE13_Pos                                      (13U)
#define GPIO_OMODE_OMODE13_Msk                                      (0x1UL << GPIO_OMODE_OMODE13_Pos)                              /*!< 0x00002000 */
#define GPIO_OMODE_OMODE13                                          GPIO_OMODE_OMODE13_Msk
#define GPIO_OMODE_OMODE14_Pos                                      (14U)
#define GPIO_OMODE_OMODE14_Msk                                      (0x1UL << GPIO_OMODE_OMODE14_Pos)                              /*!< 0x00004000 */
#define GPIO_OMODE_OMODE14                                          GPIO_OMODE_OMODE14_Msk
#define GPIO_OMODE_OMODE15_Pos                                      (15U)
#define GPIO_OMODE_OMODE15_Msk                                      (0x1UL << GPIO_OMODE_OMODE15_Pos)                              /*!< 0x00008000 */
#define GPIO_OMODE_OMODE15                                          GPIO_OMODE_OMODE15_Msk

