betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f407xx.h
/* Legacy define */
#define PMU_CSTS_REGRDY                                             PMU_CSTS_VOSRFLG

/******************************************************************************/
/*                                                                            */
/*                         Reset and Clock Control                            */
/*                                                                            */
/******************************************************************************/
/********************  Bit definition for RCM_CTRL register  ********************/
#define RCM_CTRL_HSIEN_Pos                                          (0U)
#define RCM_CTRL_HSIEN_Msk                                          (0x1UL << RCM_CTRL_HSIEN_Pos)                                  /*!< 0x00000001 */
#define RCM_CTRL_HSIEN                                              RCM_CTRL_HSIEN_Msk
#define RCM_CTRL_HSIRDYFLG_Pos                                      (1U)
#define RCM_CTRL_HSIRDYFLG_Msk                                      (0x1UL << RCM_CTRL_HSIRDYFLG_Pos)                              /*!< 0x00000002 */
#define RCM_CTRL_HSIRDYFLG                                          RCM_CTRL_HSIRDYFLG_Msk

#define RCM_CTRL_HSITRM_Pos                                         (3U)
#define RCM_CTRL_HSITRM_Msk                                         (0x1FUL << RCM_CTRL_HSITRM_Pos)                                /*!< 0x000000F8 */
#define RCM_CTRL_HSITRM                                             RCM_CTRL_HSITRM_Msk
#define RCM_CTRL_HSITRM_0                                           (0x01UL << RCM_CTRL_HSITRM_Pos)                                /*!< 0x00000008 */
#define RCM_CTRL_HSITRM_1                                           (0x02UL << RCM_CTRL_HSITRM_Pos)                                /*!< 0x00000010 */
#define RCM_CTRL_HSITRM_2                                           (0x04UL << RCM_CTRL_HSITRM_Pos)                                /*!< 0x00000020 */
#define RCM_CTRL_HSITRM_3                                           (0x08UL << RCM_CTRL_HSITRM_Pos)                                /*!< 0x00000040 */
#define RCM_CTRL_HSITRM_4                                           (0x10UL << RCM_CTRL_HSITRM_Pos)                                /*!< 0x00000080 */

#define RCM_CTRL_HSICAL_Pos                                         (8U)
#define RCM_CTRL_HSICAL_Msk                                         (0xFFUL << RCM_CTRL_HSICAL_Pos)                                /*!< 0x0000FF00 */
#define RCM_CTRL_HSICAL                                             RCM_CTRL_HSICAL_Msk
#define RCM_CTRL_HSICAL_0                                           (0x01UL << RCM_CTRL_HSICAL_Pos)                                /*!< 0x00000100 */
#define RCM_CTRL_HSICAL_1                                           (0x02UL << RCM_CTRL_HSICAL_Pos)                                /*!< 0x00000200 */
#define RCM_CTRL_HSICAL_2                                           (0x04UL << RCM_CTRL_HSICAL_Pos)                                /*!< 0x00000400 */
#define RCM_CTRL_HSICAL_3                                           (0x08UL << RCM_CTRL_HSICAL_Pos)                                /*!< 0x00000800 */
#define RCM_CTRL_HSICAL_4                                           (0x10UL << RCM_CTRL_HSICAL_Pos)                                /*!< 0x00001000 */
#define RCM_CTRL_HSICAL_5                                           (0x20UL << RCM_CTRL_HSICAL_Pos)                                /*!< 0x00002000 */
#define RCM_CTRL_HSICAL_6                                           (0x40UL << RCM_CTRL_HSICAL_Pos)                                /*!< 0x00004000 */
#define RCM_CTRL_HSICAL_7                                           (0x80UL << RCM_CTRL_HSICAL_Pos)                                /*!< 0x00008000 */

#define RCM_CTRL_HSEEN_Pos                                          (16U)
#define RCM_CTRL_HSEEN_Msk                                          (0x1UL << RCM_CTRL_HSEEN_Pos)                                  /*!< 0x00010000 */
#define RCM_CTRL_HSEEN                                              RCM_CTRL_HSEEN_Msk
#define RCM_CTRL_HSERDYFLG_Pos                                      (17U)
#define RCM_CTRL_HSERDYFLG_Msk                                      (0x1UL << RCM_CTRL_HSERDYFLG_Pos)                              /*!< 0x00020000 */
#define RCM_CTRL_HSERDYFLG                                          RCM_CTRL_HSERDYFLG_Msk
#define RCM_CTRL_HSEBCFG_Pos                                        (18U)
#define RCM_CTRL_HSEBCFG_Msk                                        (0x1UL << RCM_CTRL_HSEBCFG_Pos)                                /*!< 0x00040000 */
#define RCM_CTRL_HSEBCFG                                            RCM_CTRL_HSEBCFG_Msk
#define RCM_CTRL_CSSEN_Pos                                          (19U)
#define RCM_CTRL_CSSEN_Msk                                          (0x1UL << RCM_CTRL_CSSEN_Pos)                                  /*!< 0x00080000 */
#define RCM_CTRL_CSSEN                                              RCM_CTRL_CSSEN_Msk
#define RCM_CTRL_PLL1EN_Pos                                         (24U)
#define RCM_CTRL_PLL1EN_Msk                                         (0x1UL << RCM_CTRL_PLL1EN_Pos)                                 /*!< 0x01000000 */
#define RCM_CTRL_PLL1EN                                             RCM_CTRL_PLL1EN_Msk
#define RCM_CTRL_PLL1RDYFLG_Pos                                     (25U)
#define RCM_CTRL_PLL1RDYFLG_Msk                                     (0x1UL << RCM_CTRL_PLL1RDYFLG_Pos)                             /*!< 0x02000000 */
#define RCM_CTRL_PLL1RDYFLG                                         RCM_CTRL_PLL1RDYFLG_Msk
/*
 * @brief Specific device feature definitions (not present on all devices in the APM32F4 serie)
 */
#define RCM_PLLI2S_SUPPORT                                                                                                         /*!< Support PLLI2S oscillator */

#define RCM_CTRL_PLL2EN_Pos                                         (26U)
#define RCM_CTRL_PLL2EN_Msk                                         (0x1UL << RCM_CTRL_PLL2EN_Pos)                                 /*!< 0x04000000 */
#define RCM_CTRL_PLL2EN                                             RCM_CTRL_PLL2EN_Msk
#define RCM_CTRL_PLL2RDYFLG_Pos                                     (27U)
#define RCM_CTRL_PLL2RDYFLG_Msk                                     (0x1UL << RCM_CTRL_PLL2RDYFLG_Pos)                             /*!< 0x08000000 */
#define RCM_CTRL_PLL2RDYFLG                                         RCM_CTRL_PLL2RDYFLG_Msk

/********************  Bit definition for RCM_PLL1CFG register  ***************/
#define RCM_PLL1CFG_PLLB_Pos                                        (0U)
#define RCM_PLL1CFG_PLLB_Msk                                        (0x3FUL << RCM_PLL1CFG_PLLB_Pos)                               /*!< 0x0000003F */
#define RCM_PLL1CFG_PLLB                                            RCM_PLL1CFG_PLLB_Msk
#define RCM_PLL1CFG_PLLB_0                                          (0x01UL << RCM_PLL1CFG_PLLB_Pos)                               /*!< 0x00000001 */
#define RCM_PLL1CFG_PLLB_1                                          (0x02UL << RCM_PLL1CFG_PLLB_Pos)                               /*!< 0x00000002 */
#define RCM_PLL1CFG_PLLB_2                                          (0x04UL << RCM_PLL1CFG_PLLB_Pos)                               /*!< 0x00000004 */
#define RCM_PLL1CFG_PLLB_3                                          (0x08UL << RCM_PLL1CFG_PLLB_Pos)                               /*!< 0x00000008 */
#define RCM_PLL1CFG_PLLB_4                                          (0x10UL << RCM_PLL1CFG_PLLB_Pos)                               /*!< 0x00000010 */
#define RCM_PLL1CFG_PLLB_5                                          (0x20UL << RCM_PLL1CFG_PLLB_Pos)                               /*!< 0x00000020 */

#define RCM_PLL1CFG_PLL1A_Pos                                       (6U)
#define RCM_PLL1CFG_PLL1A_Msk                                       (0x1FFUL << RCM_PLL1CFG_PLL1A_Pos)                             /*!< 0x00007FC0 */
#define RCM_PLL1CFG_PLL1A                                           RCM_PLL1CFG_PLL1A_Msk
#define RCM_PLL1CFG_PLL1A_0                                         (0x001UL << RCM_PLL1CFG_PLL1A_Pos)                             /*!< 0x00000040 */
#define RCM_PLL1CFG_PLL1A_1                                         (0x002UL << RCM_PLL1CFG_PLL1A_Pos)                             /*!< 0x00000080 */
#define RCM_PLL1CFG_PLL1A_2                                         (0x004UL << RCM_PLL1CFG_PLL1A_Pos)                             /*!< 0x00000100 */
#define RCM_PLL1CFG_PLL1A_3                                         (0x008UL << RCM_PLL1CFG_PLL1A_Pos)                             /*!< 0x00000200 */
#define RCM_PLL1CFG_PLL1A_4                                         (0x010UL << RCM_PLL1CFG_PLL1A_Pos)                             /*!< 0x00000400 */
#define RCM_PLL1CFG_PLL1A_5                                         (0x020UL << RCM_PLL1CFG_PLL1A_Pos)                             /*!< 0x00000800 */
#define RCM_PLL1CFG_PLL1A_6                                         (0x040UL << RCM_PLL1CFG_PLL1A_Pos)                             /*!< 0x00001000 */
#define RCM_PLL1CFG_PLL1A_7                                         (0x080UL << RCM_PLL1CFG_PLL1A_Pos)                             /*!< 0x00002000 */
#define RCM_PLL1CFG_PLL1A_8                                         (0x100UL << RCM_PLL1CFG_PLL1A_Pos)                             /*!< 0x00004000 */

#define RCM_PLL1CFG_PLL1C_Pos                                       (16U)
#define RCM_PLL1CFG_PLL1C_Msk                                       (0x3UL << RCM_PLL1CFG_PLL1C_Pos)                               /*!< 0x00030000 */
#define RCM_PLL1CFG_PLL1C                                           RCM_PLL1CFG_PLL1C_Msk
#define RCM_PLL1CFG_PLL1C_0                                         (0x1UL << RCM_PLL1CFG_PLL1C_Pos)                               /*!< 0x00010000 */
#define RCM_PLL1CFG_PLL1C_1                                         (0x2UL << RCM_PLL1CFG_PLL1C_Pos)                               /*!< 0x00020000 */

#define RCM_PLL1CFG_PLL1CLKS_Pos                                    (22U)
#define RCM_PLL1CFG_PLL1CLKS_Msk                                    (0x1UL << RCM_PLL1CFG_PLL1CLKS_Pos)                            /*!< 0x00400000 */
#define RCM_PLL1CFG_PLL1CLKS                                        RCM_PLL1CFG_PLL1CLKS_Msk
#define RCM_PLL1CFG_PLL1CLKS_HSE_Pos                                (22U)
#define RCM_PLL1CFG_PLL1CLKS_HSE_Msk                                (0x1UL << RCM_PLL1CFG_PLL1CLKS_HSE_Pos)                        /*!< 0x00400000 */
#define RCM_PLL1CFG_PLL1CLKS_HSE                                    RCM_PLL1CFG_PLL1CLKS_HSE_Msk
#define RCM_PLL1CFG_PLL1CLKS_HSI                                    0x00000000U

