betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f407xx.h
/*
 * @brief Specific device feature definitions (not present on all devices in the APM32F4 serie)
 */
#define RCM_LPAHB2_SUPPORT

/********************  Bit definition for RCM_LPAHB2CLKEN register  *************/
#define RCM_LPAHB2CLKEN_DCIEN_Pos                                   (0U)
#define RCM_LPAHB2CLKEN_DCIEN_Msk                                   (0x1UL << RCM_LPAHB2CLKEN_DCIEN_Pos)                           /*!< 0x00000001 */
#define RCM_LPAHB2CLKEN_DCIEN                                       RCM_LPAHB2CLKEN_DCIEN_Msk
#define RCM_LPAHB2CLKEN_FPUEN_Pos                                   (1U)
#define RCM_LPAHB2CLKEN_FPUEN_Msk                                   (0x1UL << RCM_LPAHB2CLKEN_FPUEN_Pos)                           /*!< 0x00000010 */
#define RCM_LPAHB2CLKEN_FPUEN                                       RCM_LPAHB2CLKEN_FPUEN_Msk
#define RCM_LPAHB2CLKEN_RNGEN_Pos                                   (6U)
#define RCM_LPAHB2CLKEN_RNGEN_Msk                                   (0x1UL << RCM_LPAHB2CLKEN_RNGEN_Pos)                           /*!< 0x00000040 */
#define RCM_LPAHB2CLKEN_RNGEN                                       RCM_LPAHB2CLKEN_RNGEN_Msk
#define RCM_LPAHB2CLKEN_OTGFSEN_Pos                                 (7U)
#define RCM_LPAHB2CLKEN_OTGFSEN_Msk                                 (0x1UL << RCM_LPAHB2CLKEN_OTGFSEN_Pos)                         /*!< 0x00000080 */
#define RCM_LPAHB2CLKEN_OTGFSEN                                     RCM_LPAHB2CLKEN_OTGFSEN_Msk

/*
 * @brief Specific device feature definitions (not present on all devices in the APM32F4 serie)
 */
#define RCM_LPAHB3_SUPPORT

/********************  Bit definition for RCM_LPAHB3CLKEN register  *************/
#define RCM_LPAHB3CLKEN_EMMCEN_Pos                                  (0U)
#define RCM_LPAHB3CLKEN_EMMCEN_Msk                                  (0x1UL << RCM_LPAHB3CLKEN_EMMCEN_Pos)                          /*!< 0x00000001 */
#define RCM_LPAHB3CLKEN_EMMCEN                                      RCM_LPAHB3CLKEN_EMMCEN_Msk

/*
 * @brief Specific device feature definitions (not present on all devices in the APM32F4 serie)
 */
#define RCM_LPAPB1_SUPPORT

/********************  Bit definition for RCM_LPAPB1CLKEN register  *************/
#define RCM_LPAPB1CLKEN_TMR2EN_Pos                                  (0U)
#define RCM_LPAPB1CLKEN_TMR2EN_Msk                                  (0x1UL << RCM_LPAPB1CLKEN_TMR2EN_Pos)                          /*!< 0x00000001 */
#define RCM_LPAPB1CLKEN_TMR2EN                                      RCM_LPAPB1CLKEN_TMR2EN_Msk
#define RCM_LPAPB1CLKEN_TMR3EN_Pos                                  (1U)
#define RCM_LPAPB1CLKEN_TMR3EN_Msk                                  (0x1UL << RCM_LPAPB1CLKEN_TMR3EN_Pos)                          /*!< 0x00000002 */
#define RCM_LPAPB1CLKEN_TMR3EN                                      RCM_LPAPB1CLKEN_TMR3EN_Msk
#define RCM_LPAPB1CLKEN_TMR4EN_Pos                                  (2U)
#define RCM_LPAPB1CLKEN_TMR4EN_Msk                                  (0x1UL << RCM_LPAPB1CLKEN_TMR4EN_Pos)                          /*!< 0x00000004 */
#define RCM_LPAPB1CLKEN_TMR4EN                                      RCM_LPAPB1CLKEN_TMR4EN_Msk
#define RCM_LPAPB1CLKEN_TMR5EN_Pos                                  (3U)
#define RCM_LPAPB1CLKEN_TMR5EN_Msk                                  (0x1UL << RCM_LPAPB1CLKEN_TMR5EN_Pos)                          /*!< 0x00000008 */
#define RCM_LPAPB1CLKEN_TMR5EN                                      RCM_LPAPB1CLKEN_TMR5EN_Msk
#define RCM_LPAPB1CLKEN_TMR6EN_Pos                                  (4U)
#define RCM_LPAPB1CLKEN_TMR6EN_Msk                                  (0x1UL << RCM_LPAPB1CLKEN_TMR6EN_Pos)                          /*!< 0x00000010 */
#define RCM_LPAPB1CLKEN_TMR6EN                                      RCM_LPAPB1CLKEN_TMR6EN_Msk
#define RCM_LPAPB1CLKEN_TMR7EN_Pos                                  (5U)
#define RCM_LPAPB1CLKEN_TMR7EN_Msk                                  (0x1UL << RCM_LPAPB1CLKEN_TMR7EN_Pos)                          /*!< 0x00000020 */
#define RCM_LPAPB1CLKEN_TMR7EN                                      RCM_LPAPB1CLKEN_TMR7EN_Msk
#define RCM_LPAPB1CLKEN_TMR12EN_Pos                                 (6U)
#define RCM_LPAPB1CLKEN_TMR12EN_Msk                                 (0x1UL << RCM_LPAPB1CLKEN_TMR12EN_Pos)                         /*!< 0x00000040 */
#define RCM_LPAPB1CLKEN_TMR12EN                                     RCM_LPAPB1CLKEN_TMR12EN_Msk
#define RCM_LPAPB1CLKEN_TMR13EN_Pos                                 (7U)
#define RCM_LPAPB1CLKEN_TMR13EN_Msk                                 (0x1UL << RCM_LPAPB1CLKEN_TMR13EN_Pos)                         /*!< 0x00000080 */
#define RCM_LPAPB1CLKEN_TMR13EN                                     RCM_LPAPB1CLKEN_TMR13EN_Msk
#define RCM_LPAPB1CLKEN_TMR14EN_Pos                                 (8U)
#define RCM_LPAPB1CLKEN_TMR14EN_Msk                                 (0x1UL << RCM_LPAPB1CLKEN_TMR14EN_Pos)                         /*!< 0x00000100 */
#define RCM_LPAPB1CLKEN_TMR14EN                                     RCM_LPAPB1CLKEN_TMR14EN_Msk
#define RCM_LPAPB1CLKEN_WWDTEN_Pos                                  (11U)
#define RCM_LPAPB1CLKEN_WWDTEN_Msk                                  (0x1UL << RCM_LPAPB1CLKEN_WWDTEN_Pos)                          /*!< 0x00000800 */
#define RCM_LPAPB1CLKEN_WWDTEN                                      RCM_LPAPB1CLKEN_WWDTEN_Msk
#define RCM_LPAPB1CLKEN_SPI2EN_Pos                                  (14U)
#define RCM_LPAPB1CLKEN_SPI2EN_Msk                                  (0x1UL << RCM_LPAPB1CLKEN_SPI2EN_Pos)                          /*!< 0x00004000 */
#define RCM_LPAPB1CLKEN_SPI2EN                                      RCM_LPAPB1CLKEN_SPI2EN_Msk
#define RCM_LPAPB1CLKEN_SPI3EN_Pos                                  (15U)
#define RCM_LPAPB1CLKEN_SPI3EN_Msk                                  (0x1UL << RCM_LPAPB1CLKEN_SPI3EN_Pos)                          /*!< 0x00008000 */
#define RCM_LPAPB1CLKEN_SPI3EN                                      RCM_LPAPB1CLKEN_SPI3EN_Msk
#define RCM_LPAPB1CLKEN_USART2EN_Pos                                (17U)
#define RCM_LPAPB1CLKEN_USART2EN_Msk                                (0x1UL << RCM_LPAPB1CLKEN_USART2EN_Pos)                        /*!< 0x00020000 */
#define RCM_LPAPB1CLKEN_USART2EN                                    RCM_LPAPB1CLKEN_USART2EN_Msk
#define RCM_LPAPB1CLKEN_USART3EN_Pos                                (18U)
#define RCM_LPAPB1CLKEN_USART3EN_Msk                                (0x1UL << RCM_LPAPB1CLKEN_USART3EN_Pos)                        /*!< 0x00040000 */
#define RCM_LPAPB1CLKEN_USART3EN                                    RCM_LPAPB1CLKEN_USART3EN_Msk
#define RCM_LPAPB1CLKEN_UART4EN_Pos                                 (19U)
#define RCM_LPAPB1CLKEN_UART4EN_Msk                                 (0x1UL << RCM_LPAPB1CLKEN_UART4EN_Pos)                         /*!< 0x00080000 */
#define RCM_LPAPB1CLKEN_UART4EN                                     RCM_LPAPB1CLKEN_UART4EN_Msk
#define RCM_LPAPB1CLKEN_UART5EN_Pos                                 (20U)
#define RCM_LPAPB1CLKEN_UART5EN_Msk                                 (0x1UL << RCM_LPAPB1CLKEN_UART5EN_Pos)                         /*!< 0x00100000 */
#define RCM_LPAPB1CLKEN_UART5EN                                     RCM_LPAPB1CLKEN_UART5EN_Msk
#define RCM_LPAPB1CLKEN_I2C1EN_Pos                                  (21U)
#define RCM_LPAPB1CLKEN_I2C1EN_Msk                                  (0x1UL << RCM_LPAPB1CLKEN_I2C1EN_Pos)                          /*!< 0x00200000 */
#define RCM_LPAPB1CLKEN_I2C1EN                                      RCM_LPAPB1CLKEN_I2C1EN_Msk
#define RCM_LPAPB1CLKEN_I2C2EN_Pos                                  (22U)
#define RCM_LPAPB1CLKEN_I2C2EN_Msk                                  (0x1UL << RCM_LPAPB1CLKEN_I2C2EN_Pos)                          /*!< 0x00400000 */
#define RCM_LPAPB1CLKEN_I2C2EN                                      RCM_LPAPB1CLKEN_I2C2EN_Msk
#define RCM_LPAPB1CLKEN_I2C3EN_Pos                                  (23U)
#define RCM_LPAPB1CLKEN_I2C3EN_Msk                                  (0x1UL << RCM_LPAPB1CLKEN_I2C3EN_Pos)                          /*!< 0x00800000 */
#define RCM_LPAPB1CLKEN_I2C3EN                                      RCM_LPAPB1CLKEN_I2C3EN_Msk
#define RCM_LPAPB1CLKEN_CAN1EN_Pos                                  (25U)
#define RCM_LPAPB1CLKEN_CAN1EN_Msk                                  (0x1UL << RCM_LPAPB1CLKEN_CAN1EN_Pos)                          /*!< 0x02000000 */
#define RCM_LPAPB1CLKEN_CAN1EN                                      RCM_LPAPB1CLKEN_CAN1EN_Msk
#define RCM_LPAPB1CLKEN_CAN2EN_Pos                                  (26U)
#define RCM_LPAPB1CLKEN_CAN2EN_Msk                                  (0x1UL << RCM_LPAPB1CLKEN_CAN2EN_Pos)                          /*!< 0x04000000 */
#define RCM_LPAPB1CLKEN_CAN2EN                                      RCM_LPAPB1CLKEN_CAN2EN_Msk
#define RCM_LPAPB1CLKEN_PMUEN_Pos                                   (28U)
#define RCM_LPAPB1CLKEN_PMUEN_Msk                                   (0x1UL << RCM_LPAPB1CLKEN_PMUEN_Pos)                           /*!< 0x10000000 */
#define RCM_LPAPB1CLKEN_PMUEN                                       RCM_LPAPB1CLKEN_PMUEN_Msk
#define RCM_LPAPB1CLKEN_DACEN_Pos                                   (29U)
#define RCM_LPAPB1CLKEN_DACEN_Msk                                   (0x1UL << RCM_LPAPB1CLKEN_DACEN_Pos)                           /*!< 0x20000000 */
#define RCM_LPAPB1CLKEN_DACEN                                       RCM_LPAPB1CLKEN_DACEN_Msk

