betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f407xx.h
#define RCM_BDCTRL_RTCCLKEN_Pos                                     (15U)
#define RCM_BDCTRL_RTCCLKEN_Msk                                     (0x1UL << RCM_BDCTRL_RTCCLKEN_Pos)                             /*!< 0x00008000 */
#define RCM_BDCTRL_RTCCLKEN                                         RCM_BDCTRL_RTCCLKEN_Msk
#define RCM_BDCTRL_BDRST_Pos                                        (16U)
#define RCM_BDCTRL_BDRST_Msk                                        (0x1UL << RCM_BDCTRL_BDRST_Pos)                                /*!< 0x00010000 */
#define RCM_BDCTRL_BDRST                                            RCM_BDCTRL_BDRST_Msk

/********************  Bit definition for RCM_CSTS register  *******************/
#define RCM_CSTS_LSIEN_Pos                                          (0U)
#define RCM_CSTS_LSIEN_Msk                                          (0x1UL << RCM_CSTS_LSIEN_Pos)                                  /*!< 0x00000001 */
#define RCM_CSTS_LSIEN                                              RCM_CSTS_LSIEN_Msk
#define RCM_CSTS_LSIRDYFLG_Pos                                      (1U)
#define RCM_CSTS_LSIRDYFLG_Msk                                      (0x1UL << RCM_CSTS_LSIRDYFLG_Pos)                              /*!< 0x00000002 */
#define RCM_CSTS_LSIRDYFLG                                          RCM_CSTS_LSIRDYFLG_Msk
#define RCM_CSTS_RSTFLGCLR_Pos                                      (24U)
#define RCM_CSTS_RSTFLGCLR_Msk                                      (0x1UL << RCM_CSTS_RSTFLGCLR_Pos)                              /*!< 0x01000000 */
#define RCM_CSTS_RSTFLGCLR                                          RCM_CSTS_RSTFLGCLR_Msk
#define RCM_CSTS_BORRSTFLG_Pos                                      (25U)
#define RCM_CSTS_BORRSTFLG_Msk                                      (0x1UL << RCM_CSTS_BORRSTFLG_Pos)                              /*!< 0x02000000 */
#define RCM_CSTS_BORRSTFLG                                          RCM_CSTS_BORRSTFLG_Msk
#define RCM_CSTS_PINRSTFLG_Pos                                      (26U)
#define RCM_CSTS_PINRSTFLG_Msk                                      (0x1UL << RCM_CSTS_PINRSTFLG_Pos)                              /*!< 0x04000000 */
#define RCM_CSTS_PINRSTFLG                                          RCM_CSTS_PINRSTFLG_Msk
#define RCM_CSTS_PODRSTFLG_Pos                                      (27U)
#define RCM_CSTS_PODRSTFLG_Msk                                      (0x1UL << RCM_CSTS_PODRSTFLG_Pos)                              /*!< 0x08000000 */
#define RCM_CSTS_PODRSTFLG                                          RCM_CSTS_PODRSTFLG_Msk
#define RCM_CSTS_SWRSTFLG_Pos                                       (28U)
#define RCM_CSTS_SWRSTFLG_Msk                                       (0x1UL << RCM_CSTS_SWRSTFLG_Pos)                               /*!< 0x10000000 */
#define RCM_CSTS_SWRSTFLG                                           RCM_CSTS_SWRSTFLG_Msk
#define RCM_CSTS_IWDTRSTFLG_Pos                                     (29U)
#define RCM_CSTS_IWDTRSTFLG_Msk                                     (0x1UL << RCM_CSTS_IWDTRSTFLG_Pos)                             /*!< 0x20000000 */
#define RCM_CSTS_IWDTRSTFLG                                         RCM_CSTS_IWDTRSTFLG_Msk
#define RCM_CSTS_WWDTRSTFLG_Pos                                     (30U)
#define RCM_CSTS_WWDTRSTFLG_Msk                                     (0x1UL << RCM_CSTS_WWDTRSTFLG_Pos)                             /*!< 0x40000000 */
#define RCM_CSTS_WWDTRSTFLG                                         RCM_CSTS_WWDTRSTFLG_Msk
#define RCM_CSTS_LPWRRSTFLG_Pos                                     (31U)
#define RCM_CSTS_LPWRRSTFLG_Msk                                     (0x1UL << RCM_CSTS_LPWRRSTFLG_Pos)                             /*!< 0x80000000 */
#define RCM_CSTS_LPWRRSTFLG                                         RCM_CSTS_LPWRRSTFLG_Msk
/* Legacy defines */
#define RCM_CSTS_PADRSTF                                            RCM_CSTS_PINRSTFLG
#define RCM_CSTS_WDGRSTF                                            RCM_CSTS_IWDTRSTFLG

/********************  Bit definition for RCM_SSCCFG register  *****************/
#define RCM_SSCCFG_MODPCFG_Pos                                      (0U)
#define RCM_SSCCFG_MODPCFG_Msk                                      (0x1FFFUL << RCM_SSCCFG_MODPCFG_Pos)                           /*!< 0x00001FFF */
#define RCM_SSCCFG_MODPCFG                                          RCM_SSCCFG_MODPCFG_Msk
#define RCM_SSCCFG_STEP_Pos                                         (13U)
#define RCM_SSCCFG_STEP_Msk                                         (0x7FFFUL << RCM_SSCCFG_STEP_Pos)                              /*!< 0x0FFFE000 */
#define RCM_SSCCFG_STEP                                             RCM_SSCCFG_STEP_Msk
#define RCM_SSCCFG_SSSEL_Pos                                        (30U)
#define RCM_SSCCFG_SSSEL_Msk                                        (0x1UL << RCM_SSCCFG_SSSEL_Pos)                                /*!< 0x40000000 */
#define RCM_SSCCFG_SSSEL                                            RCM_SSCCFG_SSSEL_Msk
#define RCM_SSCCFG_SSEN_Pos                                         (31U)
#define RCM_SSCCFG_SSEN_Msk                                         (0x1UL << RCM_SSCCFG_SSEN_Pos)                                 /*!< 0x80000000 */
#define RCM_SSCCFG_SSEN                                             RCM_SSCCFG_SSEN_Msk

/********************  Bit definition for RCM_PLL2CFG register  ************/
#define RCM_PLL2CFG_PLL2A_Pos                                       (6U)
#define RCM_PLL2CFG_PLL2A_Msk                                       (0x1FFUL << RCM_PLL2CFG_PLL2A_Pos)                             /*!< 0x00007FC0 */
#define RCM_PLL2CFG_PLL2A                                           RCM_PLL2CFG_PLL2A_Msk
#define RCM_PLL2CFG_PLL2A_0                                         (0x001UL << RCM_PLL2CFG_PLL2A_Pos)                             /*!< 0x00000040 */
#define RCM_PLL2CFG_PLL2A_1                                         (0x002UL << RCM_PLL2CFG_PLL2A_Pos)                             /*!< 0x00000080 */
#define RCM_PLL2CFG_PLL2A_2                                         (0x004UL << RCM_PLL2CFG_PLL2A_Pos)                             /*!< 0x00000100 */
#define RCM_PLL2CFG_PLL2A_3                                         (0x008UL << RCM_PLL2CFG_PLL2A_Pos)                             /*!< 0x00000200 */
#define RCM_PLL2CFG_PLL2A_4                                         (0x010UL << RCM_PLL2CFG_PLL2A_Pos)                             /*!< 0x00000400 */
#define RCM_PLL2CFG_PLL2A_5                                         (0x020UL << RCM_PLL2CFG_PLL2A_Pos)                             /*!< 0x00000800 */
#define RCM_PLL2CFG_PLL2A_6                                         (0x040UL << RCM_PLL2CFG_PLL2A_Pos)                             /*!< 0x00001000 */
#define RCM_PLL2CFG_PLL2A_7                                         (0x080UL << RCM_PLL2CFG_PLL2A_Pos)                             /*!< 0x00002000 */
#define RCM_PLL2CFG_PLL2A_8                                         (0x100UL << RCM_PLL2CFG_PLL2A_Pos)                             /*!< 0x00004000 */

