betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f407xx.h
#define TMR_OPT_TI4_RMPSEL_Pos                                       (6U)
#define TMR_OPT_TI4_RMPSEL_Msk                                       (0x3UL << TMR_OPT_TI4_RMPSEL_Pos)                               /*!< 0x000000C0 */
#define TMR_OPT_TI4_RMPSEL                                           TMR_OPT_TI4_RMPSEL_Msk                                          /*!<TI4_RMP[1:0] bits (TMR5 Input 4 remap)             */
#define TMR_OPT_TI4_RMPSEL_0                                         (0x1UL << TMR_OPT_TI4_RMPSEL_Pos)                               /*!< 0x0040 */
#define TMR_OPT_TI4_RMPSEL_1                                         (0x2UL << TMR_OPT_TI4_RMPSEL_Pos)                               /*!< 0x0080 */
#define TMR_OPT_RMPSEL_Pos                                           (10U)
#define TMR_OPT_RMPSEL_Msk                                           (0x3UL << TMR_OPT_RMPSEL_Pos)                                   /*!< 0x00000C00 */
#define TMR_OPT_RMPSEL                                               TMR_OPT_RMPSEL_Msk                                              /*!<ITR1_RMP[1:0] bits (TMR2 Internal trigger 1 remap) */
#define TMR_OPT_RMPSEL_0                                             (0x1UL << TMR_OPT_RMPSEL_Pos)                                   /*!< 0x0400 */
#define TMR_OPT_RMPSEL_1                                             (0x2UL << TMR_OPT_RMPSEL_Pos)                                   /*!< 0x0800 */


/******************************************************************************/
/*                                                                            */
/*         Universal Synchronous Asynchronous Receiver Transmitter            */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for USART_STS register  *******************/
#define USART_STS_PEFLG_Pos                                         (0U)
#define USART_STS_PEFLG_Msk                                         (0x1UL << USART_STS_PEFLG_Pos)                                 /*!< 0x00000001 */
#define USART_STS_PEFLG                                             USART_STS_PEFLG_Msk                                            /*!<Parity Error                 */
#define USART_STS_FEFLG_Pos                                         (1U)
#define USART_STS_FEFLG_Msk                                         (0x1UL << USART_STS_FEFLG_Pos)                                 /*!< 0x00000002 */
#define USART_STS_FEFLG                                             USART_STS_FEFLG_Msk                                            /*!<Framing Error                */
#define USART_STS_NEFLG_Pos                                         (2U)
#define USART_STS_NEFLG_Msk                                         (0x1UL << USART_STS_NEFLG_Pos)                                 /*!< 0x00000004 */
#define USART_STS_NEFLG                                             USART_STS_NEFLG_Msk                                            /*!<Noise Error Flag             */
#define USART_STS_OVREFLG_Pos                                       (3U)
#define USART_STS_OVREFLG_Msk                                       (0x1UL << USART_STS_OVREFLG_Pos)                               /*!< 0x00000008 */
#define USART_STS_OVREFLG                                           USART_STS_OVREFLG_Msk                                          /*!<OverRun Error                */
#define USART_STS_IDLEFLG_Pos                                       (4U)
#define USART_STS_IDLEFLG_Msk                                       (0x1UL << USART_STS_IDLEFLG_Pos)                               /*!< 0x00000010 */
#define USART_STS_IDLEFLG                                           USART_STS_IDLEFLG_Msk                                          /*!<IDLE line detected           */
#define USART_STS_RXBNEFLG_Pos                                      (5U)
#define USART_STS_RXBNEFLG_Msk                                      (0x1UL << USART_STS_RXBNEFLG_Pos)                              /*!< 0x00000020 */
#define USART_STS_RXBNEFLG                                          USART_STS_RXBNEFLG_Msk                                         /*!<Read Data Register Not Empty */
#define USART_STS_TXCFLG_Pos                                        (6U)
#define USART_STS_TXCFLG_Msk                                        (0x1UL << USART_STS_TXCFLG_Pos)                                /*!< 0x00000040 */
#define USART_STS_TXCFLG                                            USART_STS_TXCFLG_Msk                                           /*!<Transmission Complete        */
#define USART_STS_TXBEFLG_Pos                                       (7U)
#define USART_STS_TXBEFLG_Msk                                       (0x1UL << USART_STS_TXBEFLG_Pos)                               /*!< 0x00000080 */
#define USART_STS_TXBEFLG                                           USART_STS_TXBEFLG_Msk                                          /*!<Transmit Data Register Empty */
#define USART_STS_LBDFLG_Pos                                        (8U)
#define USART_STS_LBDFLG_Msk                                        (0x1UL << USART_STS_LBDFLG_Pos)                                /*!< 0x00000100 */
#define USART_STS_LBDFLG                                            USART_STS_LBDFLG_Msk                                           /*!<LIN Break Detection Flag     */
#define USART_STS_CTSFLG_Pos                                        (9U)
#define USART_STS_CTSFLG_Msk                                        (0x1UL << USART_STS_CTSFLG_Pos)                                /*!< 0x00000200 */
#define USART_STS_CTSFLG                                            USART_STS_CTSFLG_Msk                                           /*!<CTS Flag                     */

/*******************  Bit definition for USART_DATA register  *******************/
#define USART_DATA_DATA_Pos                                         (0U)
#define USART_DATA_DATA_Msk                                         (0x1FFUL << USART_DATA_DATA_Pos)                               /*!< 0x000001FF */
#define USART_DATA_DATA                                             USART_DATA_DATA_Msk                                            /*!<Data value */

/******************  Bit definition for USART_BR register  *******************/
#define USART_BR_FBR_Pos                                            (0U)
#define USART_BR_FBR_Msk                                            (0xFUL << USART_BR_FBR_Pos)                                    /*!< 0x0000000F */
#define USART_BR_FBR                                                USART_BR_FBR_Msk                                               /*!<Fraction of USARTDIV */
#define USART_BR_IBR_Pos                                            (4U)
#define USART_BR_IBR_Msk                                            (0xFFFUL << USART_BR_IBR_Pos)                                  /*!< 0x0000FFF0 */
#define USART_BR_IBR                                                USART_BR_IBR_Msk                                               /*!<Mantissa of USARTDIV */

/******************  Bit definition for USART_CTRL1 register  *******************/
#define USART_CTRL1_TXBF_Pos                                        (0U)
#define USART_CTRL1_TXBF_Msk                                        (0x1UL << USART_CTRL1_TXBF_Pos)                                /*!< 0x00000001 */
#define USART_CTRL1_TXBF                                            USART_CTRL1_TXBF_Msk                                           /*!<Send Break                             */
#define USART_CTRL1_RXMUTEEN_Pos                                    (1U)
#define USART_CTRL1_RXMUTEEN_Msk                                    (0x1UL << USART_CTRL1_RXMUTEEN_Pos)                            /*!< 0x00000002 */
#define USART_CTRL1_RXMUTEEN                                        USART_CTRL1_RXMUTEEN_Msk                                       /*!<Receiver wakeup                        */
#define USART_CTRL1_RXEN_Pos                                        (2U)
#define USART_CTRL1_RXEN_Msk                                        (0x1UL << USART_CTRL1_RXEN_Pos)                                /*!< 0x00000004 */
#define USART_CTRL1_RXEN                                            USART_CTRL1_RXEN_Msk                                           /*!<Receiver Enable                        */
#define USART_CTRL1_TXEN_Pos                                        (3U)
#define USART_CTRL1_TXEN_Msk                                        (0x1UL << USART_CTRL1_TXEN_Pos)                                /*!< 0x00000008 */
#define USART_CTRL1_TXEN                                            USART_CTRL1_TXEN_Msk                                           /*!<Transmitter Enable                     */
#define USART_CTRL1_IDLEIEN_Pos                                     (4U)
#define USART_CTRL1_IDLEIEN_Msk                                     (0x1UL << USART_CTRL1_IDLEIEN_Pos)                             /*!< 0x00000010 */
#define USART_CTRL1_IDLEIEN                                         USART_CTRL1_IDLEIEN_Msk                                        /*!<IDLE Interrupt Enable                  */
#define USART_CTRL1_RXBNEIEN_Pos                                    (5U)
#define USART_CTRL1_RXBNEIEN_Msk                                    (0x1UL << USART_CTRL1_RXBNEIEN_Pos)                            /*!< 0x00000020 */
#define USART_CTRL1_RXBNEIEN                                        USART_CTRL1_RXBNEIEN_Msk                                       /*!<RXNE Interrupt Enable                  */
#define USART_CTRL1_TXCIEN_Pos                                      (6U)
#define USART_CTRL1_TXCIEN_Msk                                      (0x1UL << USART_CTRL1_TXCIEN_Pos)                              /*!< 0x00000040 */
#define USART_CTRL1_TXCIEN                                          USART_CTRL1_TXCIEN_Msk                                         /*!<Transmission Complete Interrupt Enable */
#define USART_CTRL1_TXBEIEN_Pos                                     (7U)
#define USART_CTRL1_TXBEIEN_Msk                                     (0x1UL << USART_CTRL1_TXBEIEN_Pos)                             /*!< 0x00000080 */
#define USART_CTRL1_TXBEIEN                                         USART_CTRL1_TXBEIEN_Msk                                        /*!<TXE Interrupt Enable                   */
#define USART_CTRL1_PEIEN_Pos                                       (8U)
#define USART_CTRL1_PEIEN_Msk                                       (0x1UL << USART_CTRL1_PEIEN_Pos)                               /*!< 0x00000100 */
#define USART_CTRL1_PEIEN                                           USART_CTRL1_PEIEN_Msk                                          /*!<PE Interrupt Enable                    */
#define USART_CTRL1_PCFG_Pos                                        (9U)
#define USART_CTRL1_PCFG_Msk                                        (0x1UL << USART_CTRL1_PCFG_Pos)                                /*!< 0x00000200 */
#define USART_CTRL1_PCFG                                            USART_CTRL1_PCFG_Msk                                           /*!<Parity Selection                       */
#define USART_CTRL1_PCEN_Pos                                        (10U)
#define USART_CTRL1_PCEN_Msk                                        (0x1UL << USART_CTRL1_PCEN_Pos)                                /*!< 0x00000400 */
#define USART_CTRL1_PCEN                                            USART_CTRL1_PCEN_Msk                                           /*!<Parity Control Enable                  */
#define USART_CTRL1_WUPMCFG_Pos                                     (11U)
#define USART_CTRL1_WUPMCFG_Msk                                     (0x1UL << USART_CTRL1_WUPMCFG_Pos)                             /*!< 0x00000800 */
#define USART_CTRL1_WUPMCFG                                         USART_CTRL1_WUPMCFG_Msk                                        /*!<Wakeup method                          */
#define USART_CTRL1_DBLCFG_Pos                                      (12U)
#define USART_CTRL1_DBLCFG_Msk                                      (0x1UL << USART_CTRL1_DBLCFG_Pos)                              /*!< 0x00001000 */
#define USART_CTRL1_DBLCFG                                          USART_CTRL1_DBLCFG_Msk                                         /*!<Word length                            */
#define USART_CTRL1_UEN_Pos                                         (13U)
#define USART_CTRL1_UEN_Msk                                         (0x1UL << USART_CTRL1_UEN_Pos)                                 /*!< 0x00002000 */
#define USART_CTRL1_UEN                                             USART_CTRL1_UEN_Msk                                            /*!<USART Enable                           */
#define USART_CTRL1_OSMCFG_Pos                                      (15U)
#define USART_CTRL1_OSMCFG_Msk                                      (0x1UL << USART_CTRL1_OSMCFG_Pos)                              /*!< 0x00008000 */
#define USART_CTRL1_OSMCFG                                          USART_CTRL1_OSMCFG_Msk                                         /*!<USART Oversampling by 8 enable         */

/******************  Bit definition for USART_CTRL2 register  *******************/
#define USART_CTRL2_ADDR_Pos                                        (0U)
#define USART_CTRL2_ADDR_Msk                                        (0xFUL << USART_CTRL2_ADDR_Pos)                                /*!< 0x0000000F */
#define USART_CTRL2_ADDR                                            USART_CTRL2_ADDR_Msk                                           /*!<Address of the USART node            */
#define USART_CTRL2_LBDLCFG_Pos                                     (5U)
#define USART_CTRL2_LBDLCFG_Msk                                     (0x1UL << USART_CTRL2_LBDLCFG_Pos)                             /*!< 0x00000020 */
#define USART_CTRL2_LBDLCFG                                         USART_CTRL2_LBDLCFG_Msk                                        /*!<LIN Break Detection Length           */
#define USART_CTRL2_LBDIEN_Pos                                      (6U)
#define USART_CTRL2_LBDIEN_Msk                                      (0x1UL << USART_CTRL2_LBDIEN_Pos)                              /*!< 0x00000040 */
#define USART_CTRL2_LBDIEN                                          USART_CTRL2_LBDIEN_Msk                                         /*!<LIN Break Detection Interrupt Enable */
#define USART_CTRL2_LBCPOEN_Pos                                     (8U)
#define USART_CTRL2_LBCPOEN_Msk                                     (0x1UL << USART_CTRL2_LBCPOEN_Pos)                             /*!< 0x00000100 */
#define USART_CTRL2_LBCPOEN                                         USART_CTRL2_LBCPOEN_Msk                                        /*!<Last Bit Clock pulse                 */
#define USART_CTRL2_CPHA_Pos                                        (9U)
#define USART_CTRL2_CPHA_Msk                                        (0x1UL << USART_CTRL2_CPHA_Pos)                                /*!< 0x00000200 */
#define USART_CTRL2_CPHA                                            USART_CTRL2_CPHA_Msk                                           /*!<Clock Phase                          */
#define USART_CTRL2_CPOL_Pos                                        (10U)
#define USART_CTRL2_CPOL_Msk                                        (0x1UL << USART_CTRL2_CPOL_Pos)                                /*!< 0x00000400 */
#define USART_CTRL2_CPOL                                            USART_CTRL2_CPOL_Msk                                           /*!<Clock Polarity                       */
#define USART_CTRL2_CLKEN_Pos                                       (11U)
#define USART_CTRL2_CLKEN_Msk                                       (0x1UL << USART_CTRL2_CLKEN_Pos)                               /*!< 0x00000800 */
#define USART_CTRL2_CLKEN                                           USART_CTRL2_CLKEN_Msk                                          /*!<Clock Enable                         */

