betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f407xx.h
/********************  Bit definition for DBGMCU_APB2_FZ register  ************/
#define DBGMCU_APB2F_TMR1_STS_Pos                                   (0U)
#define DBGMCU_APB2F_TMR1_STS_Msk                                   (0x1UL << DBGMCU_APB2F_TMR1_STS_Pos)                           /*!< 0x00000001 */
#define DBGMCU_APB2F_TMR1_STS                                       DBGMCU_APB2F_TMR1_STS_Msk
#define DBGMCU_APB2F_TMR8_STS_Pos                                   (1U)
#define DBGMCU_APB2F_TMR8_STS_Msk                                   (0x1UL << DBGMCU_APB2F_TMR8_STS_Pos)                           /*!< 0x00000002 */
#define DBGMCU_APB2F_TMR8_STS                                       DBGMCU_APB2F_TMR8_STS_Msk
#define DBGMCU_APB2F_TMR9_STS_Pos                                   (16U)
#define DBGMCU_APB2F_TMR9_STS_Msk                                   (0x1UL << DBGMCU_APB2F_TMR9_STS_Pos)                           /*!< 0x00010000 */
#define DBGMCU_APB2F_TMR9_STS                                       DBGMCU_APB2F_TMR9_STS_Msk
#define DBGMCU_APB2F_TMR10_STS_Pos                                  (17U)
#define DBGMCU_APB2F_TMR10_STS_Msk                                  (0x1UL << DBGMCU_APB2F_TMR10_STS_Pos)                          /*!< 0x00020000 */
#define DBGMCU_APB2F_TMR10_STS                                      DBGMCU_APB2F_TMR10_STS_Msk
#define DBGMCU_APB2F_TMR11_STS_Pos                                  (18U)
#define DBGMCU_APB2F_TMR11_STS_Msk                                  (0x1UL << DBGMCU_APB2F_TMR11_STS_Pos)                          /*!< 0x00040000 */
#define DBGMCU_APB2F_TMR11_STS                                      DBGMCU_APB2F_TMR11_STS_Msk

/******************************************************************************/
/*                                                                            */
/*                Ethernet MAC Registers bits definitions                     */
/*                                                                            */
/******************************************************************************/
/* Bit definition for Ethernet MAC Control Register register */
#define ETH_MACCFG_WDTDIS_Pos                                       (23U)
#define ETH_MACCFG_WDTDIS_Msk                                       (0x1UL << ETH_MACCFG_WDTDIS_Pos)                               /*!< 0x00800000 */
#define ETH_MACCFG_WDTDIS                                           ETH_MACCFG_WDTDIS_Msk                                          /* Watchdog disable */
#define ETH_MACCFG_JDIS_Pos                                         (22U)
#define ETH_MACCFG_JDIS_Msk                                         (0x1UL << ETH_MACCFG_JDIS_Pos)                                 /*!< 0x00400000 */
#define ETH_MACCFG_JDIS                                             ETH_MACCFG_JDIS_Msk                                            /* Jabber disable */
#define ETH_MACCFG_IFG_Pos                                          (17U)
#define ETH_MACCFG_IFG_Msk                                          (0x7UL << ETH_MACCFG_IFG_Pos)                                  /*!< 0x000E0000 */
#define ETH_MACCFG_IFG                                              ETH_MACCFG_IFG_Msk                                             /* Inter-frame gap */
#define ETH_MACCFG_IFG_96Bit                                        0x00000000U                                                    /* Minimum IFG between frames during transmission is 96Bit */
#define ETH_MACCFG_IFG_88Bit                                        0x00020000U                                                    /* Minimum IFG between frames during transmission is 88Bit */
#define ETH_MACCFG_IFG_80Bit                                        0x00040000U                                                    /* Minimum IFG between frames during transmission is 80Bit */
#define ETH_MACCFG_IFG_72Bit                                        0x00060000U                                                    /* Minimum IFG between frames during transmission is 72Bit */
#define ETH_MACCFG_IFG_64Bit                                        0x00080000U                                                    /* Minimum IFG between frames during transmission is 64Bit */
#define ETH_MACCFG_IFG_56Bit                                        0x000A0000U                                                    /* Minimum IFG between frames during transmission is 56Bit */
#define ETH_MACCFG_IFG_48Bit                                        0x000C0000U                                                    /* Minimum IFG between frames during transmission is 48Bit */
#define ETH_MACCFG_IFG_40Bit                                        0x000E0000U                                                    /* Minimum IFG between frames during transmission is 40Bit */
#define ETH_MACCFG_DISCRS_Pos                                       (16U)
#define ETH_MACCFG_DISCRS_Msk                                       (0x1UL << ETH_MACCFG_DISCRS_Pos)                               /*!< 0x00010000 */
#define ETH_MACCFG_DISCRS                                           ETH_MACCFG_DISCRS_Msk                                          /* Carrier sense disable (during transmission) */
#define ETH_MACCFG_SSEL_Pos                                         (14U)
#define ETH_MACCFG_SSEL_Msk                                         (0x1UL << ETH_MACCFG_SSEL_Pos)                                 /*!< 0x00004000 */
#define ETH_MACCFG_SSEL                                             ETH_MACCFG_SSEL_Msk                                            /* Fast ethernet speed */
#define ETH_MACCFG_DISRXO_Pos                                       (13U)
#define ETH_MACCFG_DISRXO_Msk                                       (0x1UL << ETH_MACCFG_DISRXO_Pos)                               /*!< 0x00002000 */
#define ETH_MACCFG_DISRXO                                           ETH_MACCFG_DISRXO_Msk                                          /* Receive own disable */
#define ETH_MACCFG_LBM_Pos                                          (12U)
#define ETH_MACCFG_LBM_Msk                                          (0x1UL << ETH_MACCFG_LBM_Pos)                                  /*!< 0x00001000 */
#define ETH_MACCFG_LBM                                              ETH_MACCFG_LBM_Msk                                             /* loopback mode */
#define ETH_MACCFG_DM_Pos                                           (11U)
#define ETH_MACCFG_DM_Msk                                           (0x1UL << ETH_MACCFG_DM_Pos)                                   /*!< 0x00000800 */
#define ETH_MACCFG_DM                                               ETH_MACCFG_DM_Msk                                              /* Duplex mode */
#define ETH_MACCFG_IPC_Pos                                          (10U)
#define ETH_MACCFG_IPC_Msk                                          (0x1UL << ETH_MACCFG_IPC_Pos)                                  /*!< 0x00000400 */
#define ETH_MACCFG_IPC                                              ETH_MACCFG_IPC_Msk                                             /* IP Checksum offload */
#define ETH_MACCFG_DISR_Pos                                         (9U)
#define ETH_MACCFG_DISR_Msk                                         (0x1UL << ETH_MACCFG_DISR_Pos)                                 /*!< 0x00000200 */
#define ETH_MACCFG_DISR                                             ETH_MACCFG_DISR_Msk                                            /* Retry disable */
#define ETH_MACCFG_ACS_Pos                                          (7U)
#define ETH_MACCFG_ACS_Msk                                          (0x1UL << ETH_MACCFG_ACS_Pos)                                  /*!< 0x00000080 */
#define ETH_MACCFG_ACS                                              ETH_MACCFG_ACS_Msk                                             /* Automatic Pad/CRC stripping */
#define ETH_MACCFG_BL_Pos                                           (5U)
#define ETH_MACCFG_BL_Msk                                           (0x3UL << ETH_MACCFG_BL_Pos)                                   /*!< 0x00000060 */
#define ETH_MACCFG_BL                                               ETH_MACCFG_BL_Msk                                              /* Back-off limit: random integer number (r) of slot time delays before rescheduling
                                                       a transmission attempt during retries after a collision: 0 =< r <2^k */
#define ETH_MACCFG_BL_10                                            0x00000000U                                                    /* k = min (n, 10) */
#define ETH_MACCFG_BL_8                                             0x00000020U                                                    /* k = min (n, 8) */
#define ETH_MACCFG_BL_4                                             0x00000040U                                                    /* k = min (n, 4) */
#define ETH_MACCFG_BL_1                                             0x00000060U                                                    /* k = min (n, 1) */
#define ETH_MACCFG_DC_Pos                                           (4U)
#define ETH_MACCFG_DC_Msk                                           (0x1UL << ETH_MACCFG_DC_Pos)                                   /*!< 0x00000010 */
#define ETH_MACCFG_DC                                               ETH_MACCFG_DC_Msk                                              /* Defferal check */
#define ETH_MACCFG_TXEN_Pos                                         (3U)
#define ETH_MACCFG_TXEN_Msk                                         (0x1UL << ETH_MACCFG_TXEN_Pos)                                 /*!< 0x00000008 */
#define ETH_MACCFG_TXEN                                             ETH_MACCFG_TXEN_Msk                                            /* Transmitter enable */
#define ETH_MACCFG_RXEN_Pos                                         (2U)
#define ETH_MACCFG_RXEN_Msk                                         (0x1UL << ETH_MACCFG_RXEN_Pos)                                 /*!< 0x00000004 */
#define ETH_MACCFG_RXEN                                             ETH_MACCFG_RXEN_Msk                                            /* Receiver enable */

