betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f407xx.h
/* Bit definition for Ethernet MMC Received Frames with CRC Error Counter Register */
#define ETH_MMCRXFCECNT_RXFCECNT_Pos                                (0U)
#define ETH_MMCRXFCECNT_RXFCECNT_Msk                                (0xFFFFFFFFUL << ETH_MMCRXFCECNT_RXFCECNT_Pos)                 /*!< 0xFFFFFFFF */
#define ETH_MMCRXFCECNT_RXFCECNT                                    ETH_MMCRXFCECNT_RXFCECNT_Msk                                   /* Number of frames received with CRC error. */

/* Bit definition for Ethernet MMC Received Frames with Alignment Error Counter Register */
#define ETH_MMCRXFAECNT_RXFAECNT_Pos                                (0U)
#define ETH_MMCRXFAECNT_RXFAECNT_Msk                                (0xFFFFFFFFUL << ETH_MMCRXFAECNT_RXFAECNT_Pos)                 /*!< 0xFFFFFFFF */
#define ETH_MMCRXFAECNT_RXFAECNT                                    ETH_MMCRXFAECNT_RXFAECNT_Msk                                   /* Number of frames received with alignment (dribble) error */

/* Bit definition for Ethernet MMC Received Good Unicast Frames Counter Register */
#define ETH_MMCRXGUNCNT_RXFCECNT_Pos                                (0U)
#define ETH_MMCRXGUNCNT_RXFCECNT_Msk                                (0xFFFFFFFFUL << ETH_MMCRXGUNCNT_RXFCECNT_Pos)                 /*!< 0xFFFFFFFF */
#define ETH_MMCRXGUNCNT_RXFCECNT                                    ETH_MMCRXGUNCNT_RXFCECNT_Msk                                   /* Number of good unicast frames received. */

/******************************************************************************/
/*               Ethernet PTP Registers bits definition                       */
/******************************************************************************/

/* Bit definition for Ethernet PTP Time Stamp Control Register */
#define ETH_PTPTSCTRL_TSSPTPFMACEN_Pos                              (18U)
#define ETH_PTPTSCTRL_TSSPTPFMACEN_Msk                              (0x1UL << ETH_PTPTSCTRL_TSSPTPFMACEN_Pos)                      /*!< 0x00008000 */
#define ETH_PTPTSCTRL_TSSPTPFMACEN                                  ETH_PTPTSCTRL_TSSPTPFMACEN_Msk                                 /* Time stamp PTP frame filtering MAC address enable */
#define ETH_PTPTSCTRL_TSCLKNSEL_Pos                                 (16U)
#define ETH_PTPTSCTRL_TSCLKNSEL_Msk                                 (0x3UL << ETH_PTPTSCTRL_TSCLKNSEL_Pos)                         /*!< 0x00030000 */
#define ETH_PTPTSCTRL_TSCLKNSEL                                     ETH_PTPTSCTRL_TSCLKNSEL_Msk                                    /* Time stamp clock node type */
#define ETH_PTPTSCTRL_TSSMNSEL_Pos                                  (15U)
#define ETH_PTPTSCTRL_TSSMNSEL_Msk                                  (0x1UL << ETH_PTPTSCTRL_TSSMNSEL_Pos)                          /*!< 0x00008000 */
#define ETH_PTPTSCTRL_TSSMNSEL                                      ETH_PTPTSCTRL_TSSMNSEL_Msk                                     /* Time stamp snapshot for message relevant to master enable */
#define ETH_PTPTSCTRL_TSSMESEL_Pos                                  (14U)
#define ETH_PTPTSCTRL_TSSMESEL_Msk                                  (0x1UL << ETH_PTPTSCTRL_TSSMESEL_Pos)                          /*!< 0x00004000 */
#define ETH_PTPTSCTRL_TSSMESEL                                      ETH_PTPTSCTRL_TSSMESEL_Msk                                     /* Time stamp snapshot for event message enable */
#define ETH_PTPTSCTRL_TSS4EN_Pos                                    (13U)
#define ETH_PTPTSCTRL_TSS4EN_Msk                                    (0x1UL << ETH_PTPTSCTRL_TSS4EN_Pos)                            /*!< 0x00002000 */
#define ETH_PTPTSCTRL_TSS4EN                                        ETH_PTPTSCTRL_TSS4EN_Msk                                       /* Time stamp snapshot for IPv4 frames enable */
#define ETH_PTPTSCTRL_TSS6EN_Pos                                    (12U)
#define ETH_PTPTSCTRL_TSS6EN_Msk                                    (0x1UL << ETH_PTPTSCTRL_TSS6EN_Pos)                            /*!< 0x00001000 */
#define ETH_PTPTSCTRL_TSS6EN                                        ETH_PTPTSCTRL_TSS6EN_Msk                                       /* Time stamp snapshot for IPv6 frames enable */
#define ETH_PTPTSCTRL_TSSPTPEN_Pos                                  (11U)
#define ETH_PTPTSCTRL_TSSPTPEN_Msk                                  (0x1UL << ETH_PTPTSCTRL_TSSPTPEN_Pos)                          /*!< 0x00000800 */
#define ETH_PTPTSCTRL_TSSPTPEN                                      ETH_PTPTSCTRL_TSSPTPEN_Msk                                     /* Time stamp snapshot for PTP over ethernet frames enable */
#define ETH_PTPTSCTRL_LISTVSEL_Pos                                  (10U)
#define ETH_PTPTSCTRL_LISTVSEL_Msk                                  (0x1UL << ETH_PTPTSCTRL_LISTVSEL_Pos)                          /*!< 0x00000400 */
#define ETH_PTPTSCTRL_LISTVSEL                                      ETH_PTPTSCTRL_LISTVSEL_Msk                                     /* Time stamp PTP packet snooping for version2 format enable */
#define ETH_PTPTSCTRL_TSSUBRO_Pos                                   (9U)
#define ETH_PTPTSCTRL_TSSUBRO_Msk                                   (0x1UL << ETH_PTPTSCTRL_TSSUBRO_Pos)                           /*!< 0x00000200 */
#define ETH_PTPTSCTRL_TSSUBRO                                       ETH_PTPTSCTRL_TSSUBRO_Msk                                      /* Time stamp Sub-seconds rollover */
#define ETH_PTPTSCTRL_TSSNEN_Pos                                    (8U)
#define ETH_PTPTSCTRL_TSSNEN_Msk                                    (0x1UL << ETH_PTPTSCTRL_TSSNEN_Pos)                            /*!< 0x00000100 */
#define ETH_PTPTSCTRL_TSSNEN                                        ETH_PTPTSCTRL_TSSNEN_Msk                                       /* Time stamp snapshot for all received frames enable */

#define ETH_PTPTSCTRL_TSADDUD_Pos                                   (5U)
#define ETH_PTPTSCTRL_TSADDUD_Msk                                   (0x1UL << ETH_PTPTSCTRL_TSADDUD_Pos)                           /*!< 0x00000020 */
#define ETH_PTPTSCTRL_TSADDUD                                       ETH_PTPTSCTRL_TSADDUD_Msk                                      /* Addend register update */
#define ETH_PTPTSCTRL_TSTRGIEN_Pos                                  (4U)
#define ETH_PTPTSCTRL_TSTRGIEN_Msk                                  (0x1UL << ETH_PTPTSCTRL_TSTRGIEN_Pos)                          /*!< 0x00000010 */
#define ETH_PTPTSCTRL_TSTRGIEN                                      ETH_PTPTSCTRL_TSTRGIEN_Msk                                     /* Time stamp interrupt trigger enable */
#define ETH_PTPTSCTRL_TSSTUD_Pos                                    (3U)
#define ETH_PTPTSCTRL_TSSTUD_Msk                                    (0x1UL << ETH_PTPTSCTRL_TSSTUD_Pos)                            /*!< 0x00000008 */
#define ETH_PTPTSCTRL_TSSTUD                                        ETH_PTPTSCTRL_TSSTUD_Msk                                       /* Time stamp update */
#define ETH_PTPTSCTRL_TSSTINIT_Pos                                  (2U)
#define ETH_PTPTSCTRL_TSSTINIT_Msk                                  (0x1UL << ETH_PTPTSCTRL_TSSTINIT_Pos)                          /*!< 0x00000004 */
#define ETH_PTPTSCTRL_TSSTINIT                                      ETH_PTPTSCTRL_TSSTINIT_Msk                                     /* Time stamp initialize */
#define ETH_PTPTSCTRL_TSUDSEL_Pos                                   (1U)
#define ETH_PTPTSCTRL_TSUDSEL_Msk                                   (0x1UL << ETH_PTPTSCTRL_TSUDSEL_Pos)                           /*!< 0x00000002 */
#define ETH_PTPTSCTRL_TSUDSEL                                       ETH_PTPTSCTRL_TSUDSEL_Msk                                      /* Time stamp fine or coarse update */
#define ETH_PTPTSCTRL_TSEN_Pos                                      (0U)
#define ETH_PTPTSCTRL_TSEN_Msk                                      (0x1UL << ETH_PTPTSCTRL_TSEN_Pos)                              /*!< 0x00000001 */
#define ETH_PTPTSCTRL_TSEN                                          ETH_PTPTSCTRL_TSEN_Msk                                         /* Time stamp enable */

/* Bit definition for Ethernet PTP Sub-Second Increment Register */
#define ETH_PTPSUBSECI_STSUBSECI_Pos                                (0U)
#define ETH_PTPSUBSECI_STSUBSECI_Msk                                (0xFFUL << ETH_PTPSUBSECI_STSUBSECI_Pos)                       /*!< 0x000000FF */
#define ETH_PTPSUBSECI_STSUBSECI                                    ETH_PTPSUBSECI_STSUBSECI_Msk                                   /* System time Sub-second increment value */

/* Bit definition for Ethernet PTP Time Stamp High Register */
#define ETH_PTPTSH_STSEC_Pos                                        (0U)
#define ETH_PTPTSH_STSEC_Msk                                        (0xFFFFFFFFUL << ETH_PTPTSH_STSEC_Pos)                         /*!< 0xFFFFFFFF */
#define ETH_PTPTSH_STSEC                                            ETH_PTPTSH_STSEC_Msk                                           /* System Time second */

/* Bit definition for Ethernet PTP Time Stamp Low Register */
#define ETH_PTPTSL_STSEL_Pos                                        (31U)
#define ETH_PTPTSL_STSEL_Msk                                        (0x1UL << ETH_PTPTSL_STSEL_Pos)                                /*!< 0x80000000 */
#define ETH_PTPTSL_STSEL                                            ETH_PTPTSL_STSEL_Msk                                           /* System Time Positive or negative time */
#define ETH_PTPTSL_STSUBSEC_Pos                                     (0U)
#define ETH_PTPTSL_STSUBSEC_Msk                                     (0x7FFFFFFFUL << ETH_PTPTSL_STSUBSEC_Pos)                      /*!< 0x7FFFFFFF */
#define ETH_PTPTSL_STSUBSEC                                         ETH_PTPTSL_STSUBSEC_Msk                                        /* System Time sub-seconds */

