betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f407xx.h
/********************  Bit definition for USB_OTG_HFIVL register  ********************/
#define USB_OTG_HFIVL_FIVL_Pos                                      (0U)
#define USB_OTG_HFIVL_FIVL_Msk                                      (0xFFFFUL << USB_OTG_HFIVL_FIVL_Pos)                           /*!< 0x0000FFFF */
#define USB_OTG_HFIVL_FIVL                                          USB_OTG_HFIVL_FIVL_Msk                                         /*!< Frame interval */

/********************  Bit definition for USB_OTG_HFIFM register  ********************/
#define USB_OTG_HFIFM_FNUM_Pos                                      (0U)
#define USB_OTG_HFIFM_FNUM_Msk                                      (0xFFFFUL << USB_OTG_HFIFM_FNUM_Pos)                           /*!< 0x0000FFFF */
#define USB_OTG_HFIFM_FNUM                                          USB_OTG_HFIFM_FNUM_Msk                                         /*!< Frame number         */
#define USB_OTG_HFIFM_FRTIME_Pos                                    (16U)
#define USB_OTG_HFIFM_FRTIME_Msk                                    (0xFFFFUL << USB_OTG_HFIFM_FRTIME_Pos)                         /*!< 0xFFFF0000 */
#define USB_OTG_HFIFM_FRTIME                                        USB_OTG_HFIFM_FRTIME_Msk                                       /*!< Frame time remaining */

/********************  Bit definition for USB_OTG_DSTS register  ********************/
#define USB_OTG_DSTS_SUSSTS_Pos                                     (0U)
#define USB_OTG_DSTS_SUSSTS_Msk                                     (0x1UL << USB_OTG_DSTS_SUSSTS_Pos)                             /*!< 0x00000001 */
#define USB_OTG_DSTS_SUSSTS                                         USB_OTG_DSTS_SUSSTS_Msk                                        /*!< Suspend status   */

#define USB_OTG_DSTS_ENUMSPD_Pos                                    (1U)
#define USB_OTG_DSTS_ENUMSPD_Msk                                    (0x3UL << USB_OTG_DSTS_ENUMSPD_Pos)                            /*!< 0x00000006 */
#define USB_OTG_DSTS_ENUMSPD                                        USB_OTG_DSTS_ENUMSPD_Msk                                       /*!< Enumerated speed */
#define USB_OTG_DSTS_ENUMSPD_0                                      (0x1UL << USB_OTG_DSTS_ENUMSPD_Pos)                            /*!< 0x00000002 */
#define USB_OTG_DSTS_ENUMSPD_1                                      (0x2UL << USB_OTG_DSTS_ENUMSPD_Pos)                            /*!< 0x00000004 */
#define USB_OTG_DSTS_ERTERR_Pos                                     (3U)
#define USB_OTG_DSTS_ERTERR_Msk                                     (0x1UL << USB_OTG_DSTS_ERTERR_Pos)                             /*!< 0x00000008 */
#define USB_OTG_DSTS_ERTERR                                         USB_OTG_DSTS_ERTERR_Msk                                        /*!< Erratic error     */
#define USB_OTG_DSTS_SOFNUM_Pos                                     (8U)
#define USB_OTG_DSTS_SOFNUM_Msk                                     (0x3FFFUL << USB_OTG_DSTS_SOFNUM_Pos)                          /*!< 0x003FFF00 */
#define USB_OTG_DSTS_SOFNUM                                         USB_OTG_DSTS_SOFNUM_Msk                                        /*!< Frame number of the received SOF */

/********************  Bit definition for USB_OTG_GAHBCFG register  ********************/
#define USB_OTG_GAHBCFG_GINTMASK_Pos                                (0U)
#define USB_OTG_GAHBCFG_GINTMASK_Msk                                (0x1UL << USB_OTG_GAHBCFG_GINTMASK_Pos)                        /*!< 0x00000001 */
#define USB_OTG_GAHBCFG_GINTMASK                                    USB_OTG_GAHBCFG_GINTMASK_Msk                                   /*!< Global interrupt mask */
#define USB_OTG_GAHBCFG_BLT_Pos                                     (1U)
#define USB_OTG_GAHBCFG_BLT_Msk                                     (0xFUL << USB_OTG_GAHBCFG_BLT_Pos)                             /*!< 0x0000001E */
#define USB_OTG_GAHBCFG_BLT                                         USB_OTG_GAHBCFG_BLT_Msk                                        /*!< Burst length/type */
#define USB_OTG_GAHBCFG_BLT_0                                       (0x0UL << USB_OTG_GAHBCFG_BLT_Pos)                             /*!< Single */
#define USB_OTG_GAHBCFG_BLT_1                                       (0x1UL << USB_OTG_GAHBCFG_BLT_Pos)                             /*!< INCR */
#define USB_OTG_GAHBCFG_BLT_2                                       (0x3UL << USB_OTG_GAHBCFG_BLT_Pos)                             /*!< INCR4 */
#define USB_OTG_GAHBCFG_BLT_3                                       (0x5UL << USB_OTG_GAHBCFG_BLT_Pos)                             /*!< INCR8 */
#define USB_OTG_GAHBCFG_BLT_4                                       (0x7UL << USB_OTG_GAHBCFG_BLT_Pos)                             /*!< INCR16 */
#define USB_OTG_GAHBCFG_DMAEN_Pos                                   (5U)
#define USB_OTG_GAHBCFG_DMAEN_Msk                                   (0x1UL << USB_OTG_GAHBCFG_DMAEN_Pos)                           /*!< 0x00000020 */
#define USB_OTG_GAHBCFG_DMAEN                                       USB_OTG_GAHBCFG_DMAEN_Msk                                      /*!< DMA enable */
#define USB_OTG_GAHBCFG_TXFEL_Pos                                   (7U)
#define USB_OTG_GAHBCFG_TXFEL_Msk                                   (0x1UL << USB_OTG_GAHBCFG_TXFEL_Pos)                           /*!< 0x00000080 */
#define USB_OTG_GAHBCFG_TXFEL                                       USB_OTG_GAHBCFG_TXFEL_Msk                                      /*!< TxFIFO empty level */
#define USB_OTG_GAHBCFG_PTXFEL_Pos                                  (8U)
#define USB_OTG_GAHBCFG_PTXFEL_Msk                                  (0x1UL << USB_OTG_GAHBCFG_PTXFEL_Pos)                          /*!< 0x00000100 */
#define USB_OTG_GAHBCFG_PTXFEL                                      USB_OTG_GAHBCFG_PTXFEL_Msk                                     /*!< Periodic TxFIFO empty level */

/********************  Bit definition for USB_OTG_GUSBCFG register  ********************/

#define USB_OTG_GUSBCFG_SEFLG_Pos                                   (0U)
#define USB_OTG_GUSBCFG_SEFLG_Msk                                   (0x7UL << USB_OTG_GUSBCFG_SEFLG_Pos)                           /*!< 0x00000007 */
#define USB_OTG_GUSBCFG_SEFLG                                       USB_OTG_GUSBCFG_SEFLG_Msk                                      /*!< FS timeout calibration */
#define USB_OTG_GUSBCFG_SEFLG_0                                     (0x1UL << USB_OTG_GUSBCFG_SEFLG_Pos)                           /*!< 0x00000001 */
#define USB_OTG_GUSBCFG_SEFLG_1                                     (0x2UL << USB_OTG_GUSBCFG_SEFLG_Pos)                           /*!< 0x00000002 */
#define USB_OTG_GUSBCFG_SEFLG_2                                     (0x4UL << USB_OTG_GUSBCFG_SEFLG_Pos)                           /*!< 0x00000004 */
#define USB_OTG_GUSBCFG_FSSTSEL_Pos                                 (6U)
#define USB_OTG_GUSBCFG_FSSTSEL_Msk                                 (0x1UL << USB_OTG_GUSBCFG_FSSTSEL_Pos)                         /*!< 0x00000040 */
#define USB_OTG_GUSBCFG_FSSTSEL                                     USB_OTG_GUSBCFG_FSSTSEL_Msk                                    /*!< USB 2.0 high-speed ULPI PHY or USB 1.1 full-speed serial transceiver select */
#define USB_OTG_GUSBCFG_SRPEN_Pos                                   (8U)
#define USB_OTG_GUSBCFG_SRPEN_Msk                                   (0x1UL << USB_OTG_GUSBCFG_SRPEN_Pos)                           /*!< 0x00000100 */
#define USB_OTG_GUSBCFG_SRPEN                                       USB_OTG_GUSBCFG_SRPEN_Msk                                      /*!< SRP-capable */
#define USB_OTG_GUSBCFG_HNPEN_Pos                                   (9U)
#define USB_OTG_GUSBCFG_HNPEN_Msk                                   (0x1UL << USB_OTG_GUSBCFG_HNPEN_Pos)                           /*!< 0x00000200 */
#define USB_OTG_GUSBCFG_HNPEN                                       USB_OTG_GUSBCFG_HNPEN_Msk                                      /*!< HNP-capable */
#define USB_OTG_GUSBCFG_TRTIM_Pos                                   (10U)
#define USB_OTG_GUSBCFG_TRTIM_Msk                                   (0xFUL << USB_OTG_GUSBCFG_TRTIM_Pos)                           /*!< 0x00003C00 */
#define USB_OTG_GUSBCFG_TRTIM                                       USB_OTG_GUSBCFG_TRTIM_Msk                                      /*!< USB turnaround time */
#define USB_OTG_GUSBCFG_TRTIM_0                                     (0x1UL << USB_OTG_GUSBCFG_TRTIM_Pos)                           /*!< 0x00000400 */
#define USB_OTG_GUSBCFG_TRTIM_1                                     (0x2UL << USB_OTG_GUSBCFG_TRTIM_Pos)                           /*!< 0x00000800 */
#define USB_OTG_GUSBCFG_TRTIM_2                                     (0x4UL << USB_OTG_GUSBCFG_TRTIM_Pos)                           /*!< 0x00001000 */
#define USB_OTG_GUSBCFG_TRTIM_3                                     (0x8UL << USB_OTG_GUSBCFG_TRTIM_Pos)                           /*!< 0x00002000 */
#define USB_OTG_GUSBCFG_PHYLPSEL_Pos                                (15U)
#define USB_OTG_GUSBCFG_PHYLPSEL_Msk                                (0x1UL << USB_OTG_GUSBCFG_PHYLPSEL_Pos)                        /*!< 0x00008000 */
#define USB_OTG_GUSBCFG_PHYLPSEL                                    USB_OTG_GUSBCFG_PHYLPSEL_Msk                                   /*!< PHY Low-power clock select */
#define USB_OTG_GUSBCFG_ULPISEL_Pos                                 (17U)
#define USB_OTG_GUSBCFG_ULPISEL_Msk                                 (0x1UL << USB_OTG_GUSBCFG_ULPISEL_Pos)                         /*!< 0x00020000 */
#define USB_OTG_GUSBCFG_ULPISEL                                     USB_OTG_GUSBCFG_ULPISEL_Msk                                    /*!< ULPI FS/LS select               */
#define USB_OTG_GUSBCFG_ULPIAR_Pos                                  (18U)
#define USB_OTG_GUSBCFG_ULPIAR_Msk                                  (0x1UL << USB_OTG_GUSBCFG_ULPIAR_Pos)                          /*!< 0x00040000 */
#define USB_OTG_GUSBCFG_ULPIAR                                      USB_OTG_GUSBCFG_ULPIAR_Msk                                     /*!< ULPI Auto-resume                */
#define USB_OTG_GUSBCFG_ULPICLKP_Pos                                (19U)
#define USB_OTG_GUSBCFG_ULPICLKP_Msk                                (0x1UL << USB_OTG_GUSBCFG_ULPICLKP_Pos)                        /*!< 0x00080000 */
#define USB_OTG_GUSBCFG_ULPICLKP                                    USB_OTG_GUSBCFG_ULPICLKP_Msk                                   /*!< ULPI Clock SuspendM             */
#define USB_OTG_GUSBCFG_ULPIEVDSEL_Pos                              (20U)
#define USB_OTG_GUSBCFG_ULPIEVDSEL_Msk                              (0x1UL << USB_OTG_GUSBCFG_ULPIEVDSEL_Pos)                      /*!< 0x00100000 */
#define USB_OTG_GUSBCFG_ULPIEVDSEL                                  USB_OTG_GUSBCFG_ULPIEVDSEL_Msk                                 /*!< ULPI External VBUS Drive        */
#define USB_OTG_GUSBCFG_ULPIEVC_Pos                                 (21U)
#define USB_OTG_GUSBCFG_ULPIEVC_Msk                                 (0x1UL << USB_OTG_GUSBCFG_ULPIEVC_Pos)                         /*!< 0x00200000 */
#define USB_OTG_GUSBCFG_ULPIEVC                                     USB_OTG_GUSBCFG_ULPIEVC_Msk                                    /*!< ULPI external VBUS indicator    */
#define USB_OTG_GUSBCFG_DPSEL_Pos                                   (22U)
#define USB_OTG_GUSBCFG_DPSEL_Msk                                   (0x1UL << USB_OTG_GUSBCFG_DPSEL_Pos)                           /*!< 0x00400000 */
#define USB_OTG_GUSBCFG_DPSEL                                       USB_OTG_GUSBCFG_DPSEL_Msk                                      /*!< TermSel DLine pulsing selection */
#define USB_OTG_GUSBCFG_SINI_Pos                                    (23U)
#define USB_OTG_GUSBCFG_SINI_Msk                                    (0x1UL << USB_OTG_GUSBCFG_SINI_Pos)                            /*!< 0x00800000 */
#define USB_OTG_GUSBCFG_SINI                                        USB_OTG_GUSBCFG_SINI_Msk                                       /*!< Indicator complement            */
#define USB_OTG_GUSBCFG_NPTHQ_Pos                                   (24U)
#define USB_OTG_GUSBCFG_NPTHQ_Msk                                   (0x1UL << USB_OTG_GUSBCFG_NPTHQ_Pos)                           /*!< 0x01000000 */
#define USB_OTG_GUSBCFG_NPTHQ                                       USB_OTG_GUSBCFG_NPTHQ_Msk                                      /*!< Indicator pass through          */
#define USB_OTG_GUSBCFG_ULPIIPCDIS_Pos                              (25U)
#define USB_OTG_GUSBCFG_ULPIIPCDIS_Msk                              (0x1UL << USB_OTG_GUSBCFG_ULPIIPCDIS_Pos)                      /*!< 0x02000000 */
#define USB_OTG_GUSBCFG_ULPIIPCDIS                                  USB_OTG_GUSBCFG_ULPIIPCDIS_Msk                                 /*!< ULPI interface protect disable  */
#define USB_OTG_GUSBCFG_FHMODE_Pos                                  (29U)
#define USB_OTG_GUSBCFG_FHMODE_Msk                                  (0x1UL << USB_OTG_GUSBCFG_FHMODE_Pos)                          /*!< 0x20000000 */
#define USB_OTG_GUSBCFG_FHMODE                                      USB_OTG_GUSBCFG_FHMODE_Msk                                     /*!< Forced host mode                */
#define USB_OTG_GUSBCFG_FDMODE_Pos                                  (30U)
#define USB_OTG_GUSBCFG_FDMODE_Msk                                  (0x1UL << USB_OTG_GUSBCFG_FDMODE_Pos)                          /*!< 0x40000000 */
#define USB_OTG_GUSBCFG_FDMODE                                      USB_OTG_GUSBCFG_FDMODE_Msk                                     /*!< Forced peripheral mode          */
#define USB_OTG_GUSBCFG_CTXP_Pos                                    (31U)
#define USB_OTG_GUSBCFG_CTXP_Msk                                    (0x1UL << USB_OTG_GUSBCFG_CTXP_Pos)                            /*!< 0x80000000 */
#define USB_OTG_GUSBCFG_CTXP                                        USB_OTG_GUSBCFG_CTXP_Msk                                       /*!< Corrupt Tx packet               */

