betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f407xx.h
/* Legacy define */
/********************  Bit definition for OTG register  ********************/
#define USB_OTG_CHNUM_Pos                                           (0U)
#define USB_OTG_CHNUM_Msk                                           (0xFUL << USB_OTG_CHNUM_Pos)                                   /*!< 0x0000000F */
#define USB_OTG_CHNUM                                               USB_OTG_CHNUM_Msk                                              /*!< Channel number */
#define USB_OTG_CHNUM_0                                             (0x1UL << USB_OTG_CHNUM_Pos)                                   /*!< 0x00000001 */
#define USB_OTG_CHNUM_1                                             (0x2UL << USB_OTG_CHNUM_Pos)                                   /*!< 0x00000002 */
#define USB_OTG_CHNUM_2                                             (0x4UL << USB_OTG_CHNUM_Pos)                                   /*!< 0x00000004 */
#define USB_OTG_CHNUM_3                                             (0x8UL << USB_OTG_CHNUM_Pos)                                   /*!< 0x00000008 */
#define USB_OTG_BCNT_Pos                                            (4U)
#define USB_OTG_BCNT_Msk                                            (0x7FFUL << USB_OTG_BCNT_Pos)                                  /*!< 0x00007FF0 */
#define USB_OTG_BCNT                                                USB_OTG_BCNT_Msk                                               /*!< Byte count */

#define USB_OTG_DPID_Pos                                            (15U)
#define USB_OTG_DPID_Msk                                            (0x3UL << USB_OTG_DPID_Pos)                                    /*!< 0x00018000 */
#define USB_OTG_DPID                                                USB_OTG_DPID_Msk                                               /*!< Data PID */
#define USB_OTG_DPID_0                                              (0x1UL << USB_OTG_DPID_Pos)                                    /*!< 0x00008000 */
#define USB_OTG_DPID_1                                              (0x2UL << USB_OTG_DPID_Pos)                                    /*!< 0x00010000 */

#define USB_OTG_PKTSTS_Pos                                          (17U)
#define USB_OTG_PKTSTS_Msk                                          (0xFUL << USB_OTG_PKTSTS_Pos)                                  /*!< 0x001E0000 */
#define USB_OTG_PKTSTS                                              USB_OTG_PKTSTS_Msk                                             /*!< Packet status */
#define USB_OTG_PKTSTS_0                                            (0x1UL << USB_OTG_PKTSTS_Pos)                                  /*!< 0x00020000 */
#define USB_OTG_PKTSTS_1                                            (0x2UL << USB_OTG_PKTSTS_Pos)                                  /*!< 0x00040000 */
#define USB_OTG_PKTSTS_2                                            (0x4UL << USB_OTG_PKTSTS_Pos)                                  /*!< 0x00080000 */
#define USB_OTG_PKTSTS_3                                            (0x8UL << USB_OTG_PKTSTS_Pos)                                  /*!< 0x00100000 */

#define USB_OTG_EPNUM_Pos                                           (0U)
#define USB_OTG_EPNUM_Msk                                           (0xFUL << USB_OTG_EPNUM_Pos)                                   /*!< 0x0000000F */
#define USB_OTG_EPNUM                                               USB_OTG_EPNUM_Msk                                              /*!< Endpoint number */
#define USB_OTG_EPNUM_0                                             (0x1UL << USB_OTG_EPNUM_Pos)                                   /*!< 0x00000001 */
#define USB_OTG_EPNUM_1                                             (0x2UL << USB_OTG_EPNUM_Pos)                                   /*!< 0x00000002 */
#define USB_OTG_EPNUM_2                                             (0x4UL << USB_OTG_EPNUM_Pos)                                   /*!< 0x00000004 */
#define USB_OTG_EPNUM_3                                             (0x8UL << USB_OTG_EPNUM_Pos)                                   /*!< 0x00000008 */

#define USB_OTG_FRMNUM_Pos                                          (21U)
#define USB_OTG_FRMNUM_Msk                                          (0xFUL << USB_OTG_FRMNUM_Pos)                                  /*!< 0x01E00000 */
#define USB_OTG_FRMNUM                                              USB_OTG_FRMNUM_Msk                                             /*!< Frame number */
#define USB_OTG_FRMNUM_0                                            (0x1UL << USB_OTG_FRMNUM_Pos)                                  /*!< 0x00200000 */
#define USB_OTG_FRMNUM_1                                            (0x2UL << USB_OTG_FRMNUM_Pos)                                  /*!< 0x00400000 */
#define USB_OTG_FRMNUM_2                                            (0x4UL << USB_OTG_FRMNUM_Pos)                                  /*!< 0x00800000 */
#define USB_OTG_FRMNUM_3                                            (0x8UL << USB_OTG_FRMNUM_Pos)                                  /*!< 0x01000000 */

/********************  Bit definition for OTG HS2 register  ********************/
#define USB_OTG_HS2_USB_SWITCH_usb_switch_Pos                       (0U)
#define USB_OTG_HS2_USB_SWITCH_usb_switch_Msk                       (0x1UL << USB_OTG_HS2_USB_SWITCH_usb_switch_Pos)               /*!< 0x00000001 */
#define USB_OTG_HS2_USB_SWITCH                                      USB_OTG_HS2_USB_SWITCH_usb_switch_Msk                          /*!< USB Switch */

#define USB_OTG_HS2_POWERON_CORE_poweron_core_Pos                   (0U)
#define USB_OTG_HS2_POWERON_CORE_poweron_core_Msk                   (0x1UL << USB_OTG_HS2_POWERON_CORE_poweron_core_Pos)           /*!< 0x00000001 */
#define USB_OTG_HS2_POWERON_CORE                                    USB_OTG_HS2_POWERON_CORE_poweron_core_Msk                      /*!< Power On Core */

#define USB_OTG_HS2_USB_PLL_EN_usb_pll_en_Pos                       (0U)
#define USB_OTG_HS2_USB_PLL_EN_usb_pll_en_Msk                       (0x1UL << USB_OTG_HS2_USB_PLL_EN_usb_pll_en_Pos)               /*!< 0x00000001 */
#define USB_OTG_HS2_USB_PLL_EN                                      USB_OTG_HS2_USB_PLL_EN_usb_pll_en_Msk                          /*!< USB PLL Enable */

#define USB_OTG_HS2_SHORT_5V_ENABLE_short_5v_enable_Pos             (0U)
#define USB_OTG_HS2_SHORT_5V_ENABLE_short_5v_enable_Msk             (0x1UL << USB_OTG_HS2_SHORT_5V_ENABLE_short_5v_enable_Pos)     /*!< 0x00000001 */
#define USB_OTG_HS2_SHORT_5V_ENABLE                                 USB_OTG_HS2_SHORT_5V_ENABLE_short_5v_enable_Msk                /*!< Short 5V Enable */

