betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f407xx.h
#define USB_OTG_HS2_OTG_SUSPENDM_otg_suspendm_Pos                   (0U)
#define USB_OTG_HS2_OTG_SUSPENDM_otg_suspendm_Msk                   (0x1UL << USB_OTG_HS2_OTG_SUSPENDM_otg_suspendm_Pos)           /*!< 0x00000001 */
#define USB_OTG_HS2_OTG_SUSPENDM                                    USB_OTG_HS2_OTG_SUSPENDM_otg_suspendm_Msk                      /*!< OTG VBUS Suspend */

#define USB_OTG_HS2_TXBITSTUFFENABLE_txbitstuffenable_Pos           (0U)
#define USB_OTG_HS2_TXBITSTUFFENABLE_txbitstuffenable_Msk           (0x1UL << USB_OTG_HS2_TXBITSTUFFENABLE_txbitstuffenable_Pos)   /*!< 0x00000001 */
#define USB_OTG_HS2_TXBITSTUFFENABLE                                USB_OTG_HS2_TXBITSTUFFENABLE_txbitstuffenable_Msk              /*!< TX Bit Stuff Enable */

#define USB_OTG_HS2_PLLICP_SEL_I2C_pllicp_sel_i2c_Pos               (0U)
#define USB_OTG_HS2_PLLICP_SEL_I2C_pllicp_sel_i2c_Msk               (0x1UL << USB_OTG_HS2_PLLICP_SEL_I2C_pllicp_sel_i2c_Pos)       /*!< 0x00000001 */
#define USB_OTG_HS2_PLLICP_SEL_I2C                                  USB_OTG_HS2_PLLICP_SEL_I2C_pllicp_sel_i2c_Msk                  /*!< PLL Charge Current Setting */

#define USB_OTG_HS2_HSZR_CNTL_I2C_hszr_cntl_i2c_Pos                 (0U)
#define USB_OTG_HS2_HSZR_CNTL_I2C_hszr_cntl_i2c_Msk                 (0x7UL << USB_OTG_HS2_HSZR_CNTL_I2C_hszr_cntl_i2c_Pos)         /*!< 0x00000007 */
#define USB_OTG_HS2_HSZR_CNTL_I2C                                   USB_OTG_HS2_HSZR_CNTL_I2C_hszr_cntl_i2c_Msk                    /*!< The DP/DM to the Ground Impedance Setting */

#define USB_OTG_HS2_SQVTH_CNTL_I2C_sqvth_cntl_i2c_Pos               (0U)
#define USB_OTG_HS2_SQVTH_CNTL_I2C_sqvth_cntl_i2c_Msk               (0x3UL << USB_OTG_HS2_SQVTH_CNTL_I2C_sqvth_cntl_i2c_Pos)       /*!< 0x00000003 */
#define USB_OTG_HS2_SQVTH_CNTL_I2C                                  USB_OTG_HS2_SQVTH_CNTL_I2C_sqvth_cntl_i2c_Msk                  /*!< The SQ Reference Voltage Setting */

#define USB_OTG_HS2_SW_RREF_I2C_sw_rref_i2c_Pos                     (0U)
#define USB_OTG_HS2_SW_RREF_I2C_sw_rref_i2c_Msk                     (0x7UL << USB_OTG_HS2_SW_RREF_I2C_sw_rref_i2c_Pos)             /*!< 0x00000007 */
#define USB_OTG_HS2_SW_RREF_I2C                                     USB_OTG_HS2_SW_RREF_I2C_sw_rref_i2c_Msk                        /*!< The DP/DM Output Swing Setting When HS Mode */

#define USB_OTG_HS2_SW_BUF_I2C_sw_buf_i2c_Pos                       (0U)
#define USB_OTG_HS2_SW_BUF_I2C_sw_buf_i2c_Msk                       (0x1UL << USB_OTG_HS2_SW_BUF_I2C_sw_buf_i2c_Pos)               /*!< 0x00000001 */
#define USB_OTG_HS2_SW_BUF_I2C                                      USB_OTG_HS2_SW_BUF_I2C_sw_buf_i2c_Msk                          /*!< The TX Driver Setting */

#define USB_OTG_HS2_TX2RX_T_CFG_tx2rx_t_cfg_i2c_Pos                 (0U)
#define USB_OTG_HS2_TX2RX_T_CFG_tx2rx_t_cfg_i2c_Msk                 (0x3UL << USB_OTG_HS2_TX2RX_T_CFG_tx2rx_t_cfg_i2c_Pos)         /*!< 0x00000003 */
#define USB_OTG_HS2_TX2RX_T_CFG                                     USB_OTG_HS2_TX2RX_T_CFG_tx2rx_t_cfg_i2c_Msk                    /*!< Debug Control Signal */

#define USB_OTG_HS2_TEST_ANA_FAST_I2C_test_ana_fast_i2c_Pos         (0U)
#define USB_OTG_HS2_TEST_ANA_FAST_I2C_test_ana_fast_i2c_Msk         (0x7UL << USB_OTG_HS2_TEST_ANA_FAST_I2C_test_ana_fast_i2c_Pos) /*!< 0x00000007 */
#define USB_OTG_HS2_TEST_ANA_FAST_I2C                               USB_OTG_HS2_TEST_ANA_FAST_I2C_test_ana_fast_i2c_Msk            /*!< Debug Control Signal */

#define USB_OTG_HS2_CLK_MODE_I2C_clk_mode_i2c_Pos                   (0U)
#define USB_OTG_HS2_CLK_MODE_I2C_clk_mode_i2c_Msk                   (0x7UL << USB_OTG_HS2_CLK_MODE_I2C_clk_mode_i2c_Pos)           /*!< 0x00000007 */
#define USB_OTG_HS2_CLK_MODE_I2C                                    USB_OTG_HS2_CLK_MODE_I2C_clk_mode_i2c_Msk                      /*!< Debug Control Signal */

#define USB_OTG_HS2_USB_DBNCE_FLTR_BYPASS_usb_dbnce_fltr_bypass_Pos (0U)
#define USB_OTG_HS2_USB_DBNCE_FLTR_BYPASS_usb_dbnce_fltr_bypass_Msk (0x1UL << USB_OTG_HS2_CLK_MODE_I2C_clk_mode_i2c_Pos)           /*!< 0x00000001 */
#define USB_OTG_HS2_USB_DBNCE_FLTR_BYPASS                           USB_OTG_HS2_CLK_MODE_I2C_clk_mode_i2c_Msk                      /*!< Bypass debounce filters for avalid, bvalid, vbusvalid, sessend, iddig signals when enabled */

#define USB_OTG_HS2_USB_SS_SCALEDOWN_MODE_clk_mode_i2c_Pos          (0U)
#define USB_OTG_HS2_USB_SS_SCALEDOWN_MODE_clk_mode_i2c_Msk          (0x7UL << USB_OTG_HS2_CLK_MODE_I2C_clk_mode_i2c_Pos)           /*!< 0x00000007 */
#define USB_OTG_HS2_USB_SS_SCALEDOWN_MODE                           USB_OTG_HS2_CLK_MODE_I2C_clk_mode_i2c_Msk                      /*!< Debug Control Signal */

/**
  * @}
  */

/**
  * @}
  */

/** @addtogroup Exported_macros
  * @{
  */

/******************************* ADC Instances ********************************/
#define IS_ADC_ALL_INSTANCE(INSTANCE) (((INSTANCE) == ADC1) || \
                                       ((INSTANCE) == ADC2) || \
                                       ((INSTANCE) == ADC3))

#define IS_ADC_MULTIMODE_MASTER_INSTANCE(INSTANCE) ((INSTANCE) == ADC1)

#define IS_ADC_COMMON_INSTANCE(INSTANCE) ((INSTANCE) == ADC123_COMMON)

/******************************* CAN Instances ********************************/
#define IS_CAN_ALL_INSTANCE(INSTANCE) (((INSTANCE) == CAN1) || \
                                       ((INSTANCE) == CAN2))
/******************************* CRC Instances ********************************/
#define IS_CRC_ALL_INSTANCE(INSTANCE) ((INSTANCE) == CRC)

/******************************* DAC Instances ********************************/
#define IS_DAC_ALL_INSTANCE(INSTANCE) ((INSTANCE) == DAC1)

/******************************* DCI Instances *******************************/
#define IS_DCI_ALL_INSTANCE(INSTANCE) ((INSTANCE) == DCI)

/******************************** DMA Instances *******************************/
#define IS_DMA_STREAM_ALL_INSTANCE(INSTANCE) (((INSTANCE) == DMA1_Stream0) || \
                                              ((INSTANCE) == DMA1_Stream1) || \
                                              ((INSTANCE) == DMA1_Stream2) || \
                                              ((INSTANCE) == DMA1_Stream3) || \
                                              ((INSTANCE) == DMA1_Stream4) || \
                                              ((INSTANCE) == DMA1_Stream5) || \
                                              ((INSTANCE) == DMA1_Stream6) || \
                                              ((INSTANCE) == DMA1_Stream7) || \
                                              ((INSTANCE) == DMA2_Stream0) || \
                                              ((INSTANCE) == DMA2_Stream1) || \
                                              ((INSTANCE) == DMA2_Stream2) || \
                                              ((INSTANCE) == DMA2_Stream3) || \
                                              ((INSTANCE) == DMA2_Stream4) || \
                                              ((INSTANCE) == DMA2_Stream5) || \
                                              ((INSTANCE) == DMA2_Stream6) || \
                                              ((INSTANCE) == DMA2_Stream7))

